jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/*

Copyright (c) 2010 - 2018, Nordic Semiconductor ASA All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef __NRF9120_MLM1_BITS_H
#define __NRF9120_MLM1_BITS_H

/*lint ++flb "Enter library region" */

/* Peripheral: AMLI */
/* Description: AHB Multi-Layer Interface */

/* Register: AMLI_RAMPRI_CPU */
/* Description: AHB bus master priority register for CPU */

/* Bits 31..28 : Priority register for RAM AHB slave 7 */
#define AMLI_RAMPRI_CPU_RAM7_Pos (28UL) /*!< Position of RAM7 field. */
#define AMLI_RAMPRI_CPU_RAM7_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM7_Pos) /*!< Bit mask of RAM7 field. */
#define AMLI_RAMPRI_CPU_RAM7_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM7_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM7_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM7_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM7_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM7_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM7_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM7_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM7_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM7_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM7_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM7_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM7_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM7_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM7_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM7_Pri15 (15UL) /*!< Priority 15 */

/* Bits 27..24 : Priority register for RAM AHB slave 6 */
#define AMLI_RAMPRI_CPU_RAM6_Pos (24UL) /*!< Position of RAM6 field. */
#define AMLI_RAMPRI_CPU_RAM6_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM6_Pos) /*!< Bit mask of RAM6 field. */
#define AMLI_RAMPRI_CPU_RAM6_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM6_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM6_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM6_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM6_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM6_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM6_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM6_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM6_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM6_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM6_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM6_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM6_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM6_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM6_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM6_Pri15 (15UL) /*!< Priority 15 */

/* Bits 23..20 : Priority register for RAM AHB slave 5 */
#define AMLI_RAMPRI_CPU_RAM5_Pos (20UL) /*!< Position of RAM5 field. */
#define AMLI_RAMPRI_CPU_RAM5_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM5_Pos) /*!< Bit mask of RAM5 field. */
#define AMLI_RAMPRI_CPU_RAM5_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM5_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM5_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM5_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM5_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM5_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM5_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM5_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM5_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM5_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM5_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM5_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM5_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM5_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM5_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM5_Pri15 (15UL) /*!< Priority 15 */

/* Bits 19..16 : Priority register for RAM AHB slave 4 */
#define AMLI_RAMPRI_CPU_RAM4_Pos (16UL) /*!< Position of RAM4 field. */
#define AMLI_RAMPRI_CPU_RAM4_Msk (0xFUL << AMLI_RAMPRI_CPU_RAM4_Pos) /*!< Bit mask of RAM4 field. */
#define AMLI_RAMPRI_CPU_RAM4_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM4_Pri1 (1UL) /*!< Priority 1 */
#define AMLI_RAMPRI_CPU_RAM4_Pri2 (2UL) /*!< Priority 2 */
#define AMLI_RAMPRI_CPU_RAM4_Pri3 (3UL) /*!< Priority 3 */
#define AMLI_RAMPRI_CPU_RAM4_Pri4 (4UL) /*!< Priority 4 */
#define AMLI_RAMPRI_CPU_RAM4_Pri5 (5UL) /*!< Priority 5 */
#define AMLI_RAMPRI_CPU_RAM4_Pri6 (6UL) /*!< Priority 6 */
#define AMLI_RAMPRI_CPU_RAM4_Pri7 (7UL) /*!< Priority 7 */
#define AMLI_RAMPRI_CPU_RAM4_Pri8 (8UL) /*!< Priority 8 */
#define AMLI_RAMPRI_CPU_RAM4_Pri9 (9UL) /*!< Priority 9 */
#define AMLI_RAMPRI_CPU_RAM4_Pri10 (10UL) /*!< Priority 10 */
#define AMLI_RAMPRI_CPU_RAM4_Pri11 (11UL) /*!< Priority 11 */
#define AMLI_RAMPRI_CPU_RAM4_Pri12 (12UL) /*!< Priority 12 */
#define AMLI_RAMPRI_CPU_RAM4_Pri13 (13UL) /*!< Priority 13 */
#define AMLI_RAMPRI_CPU_RAM4_Pri14 (14UL) /*!< Priority 14 */
#define AMLI_RAMPRI_CPU_RAM4_Pri15 (15UL) /*!< Priority 15 */

