jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: QSPI_STATUS */
/* Description: Status register. SPI MEM CTRL Status reg. */

/* Bits 31..24 : Value of external Flash devices Status Register. When the external Flash has two bytes status register this field includes the value of the low byte. */
#define QSPI_STATUS_SREG_Pos (24UL) /*!< Position of SREG field. */
#define QSPI_STATUS_SREG_Msk (0xFFUL << QSPI_STATUS_SREG_Pos) /*!< Bit mask of SREG field. */

/* Bit 4 : 1: Ready to serve access request. */
#define QSPI_STATUS_REQREADY_Pos (4UL) /*!< Position of REQREADY field. */
#define QSPI_STATUS_REQREADY_Msk (0x1UL << QSPI_STATUS_REQREADY_Pos) /*!< Bit mask of REQREADY field. */

/* Bit 3 : Ready status. */
#define QSPI_STATUS_READY_Pos (3UL) /*!< Position of READY field. */
#define QSPI_STATUS_READY_Msk (0x1UL << QSPI_STATUS_READY_Pos) /*!< Bit mask of READY field. */
#define QSPI_STATUS_READY_BUSY (0UL) /*!< QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM. */
#define QSPI_STATUS_READY_READY (1UL) /*!< QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM. */

/* Bit 2 : Deep Power-down Mode (DPM) status of external Flash. */
#define QSPI_STATUS_DPM_Pos (2UL) /*!< Position of DPM field. */
#define QSPI_STATUS_DPM_Msk (0x1UL << QSPI_STATUS_DPM_Pos) /*!< Bit mask of DPM field. */
#define QSPI_STATUS_DPM_Disabled (0UL) /*!< External flash is not in DPM. */
#define QSPI_STATUS_DPM_Enabled (1UL) /*!< External flash is in DPM. */

/* Bit 1 : Internal TX FIFO contains data not yet written to external Flash. */
#define QSPI_STATUS_TXDATAREADY_Pos (1UL) /*!< Position of TXDATAREADY field. */
#define QSPI_STATUS_TXDATAREADY_Msk (0x1UL << QSPI_STATUS_TXDATAREADY_Pos) /*!< Bit mask of TXDATAREADY field. */

/* Bit 0 : Internal RX FIFO contains data from external Flash. */
#define QSPI_STATUS_RXDATAREADY_Pos (0UL) /*!< Position of RXDATAREADY field. */
#define QSPI_STATUS_RXDATAREADY_Msk (0x1UL << QSPI_STATUS_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field. */

/* Register: QSPI_ACCESSREQ0 */
/* Description: Access request, word 0. SPI MEM CTRL Access Request reg. 0. */

/* Bits 31..0 :   */
#define QSPI_ACCESSREQ0_ACCESSREQ0_Pos (0UL) /*!< Position of ACCESSREQ0 field. */
#define QSPI_ACCESSREQ0_ACCESSREQ0_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ0_ACCESSREQ0_Pos) /*!< Bit mask of ACCESSREQ0 field. */

/* Register: QSPI_ACCESSREQ1 */
/* Description: Access request, word 1. SPI MEM CTRL Access Request reg. 1. */

/* Bits 31..0 :   */
#define QSPI_ACCESSREQ1_ACCESSREQ1_Pos (0UL) /*!< Position of ACCESSREQ1 field. */
#define QSPI_ACCESSREQ1_ACCESSREQ1_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ1_ACCESSREQ1_Pos) /*!< Bit mask of ACCESSREQ1 field. */

/* Register: QSPI_ACCESSREQ2 */
/* Description: Access request, word 2. SPI MEM CTRL Access Request reg. 2. */

/* Bits 31..0 :   */
#define QSPI_ACCESSREQ2_ACCESSREQ2_Pos (0UL) /*!< Position of ACCESSREQ2 field. */
#define QSPI_ACCESSREQ2_ACCESSREQ2_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ2_ACCESSREQ2_Pos) /*!< Bit mask of ACCESSREQ2 field. */

/* Register: QSPI_DPMDUR */
/* Description: Set the duration required to enter/exit Deep Power-down Mode (DPM). SPI MEM CTRL Duration DPM reg. */

/* Bits 31..16 : Duration need by external Flash to exit DPM. Duration is given as EXIT * 256 * 62.5 ns. */
#define QSPI_DPMDUR_EXIT_Pos (16UL) /*!< Position of EXIT field. */
#define QSPI_DPMDUR_EXIT_Msk (0xFFFFUL << QSPI_DPMDUR_EXIT_Pos) /*!< Bit mask of EXIT field. */

/* Bits 15..0 : Duration need by external Flash to enter DPM. Duration is given as ENTER * 256 * 62.5 ns. */
#define QSPI_DPMDUR_ENTER_Pos (0UL) /*!< Position of ENTER field. */
#define QSPI_DPMDUR_ENTER_Msk (0xFFFFUL << QSPI_DPMDUR_ENTER_Pos) /*!< Bit mask of ENTER field. */

/* Register: QSPI_DATARW */
/* Description: Read data when read, write data when written. SPI MEM CTRL Read/Write Data reg. */

/* Bits 31..0 :   */
#define QSPI_DATARW_DATARW_Pos (0UL) /*!< Position of DATARW field. */
#define QSPI_DATARW_DATARW_Msk (0xFFFFFFFFUL << QSPI_DATARW_DATARW_Pos) /*!< Bit mask of DATARW field. */

/* Register: QSPI_FIFOSTAT */
/* Description: The number of items in Read and Write FIFOs. SPI MEM CTRL FIFOs Status reg. */

/* Bits 31..0 :   */
#define QSPI_FIFOSTAT_FIFOSTAT_Pos (0UL) /*!< Position of FIFOSTAT field. */
#define QSPI_FIFOSTAT_FIFOSTAT_Msk (0xFFFFFFFFUL << QSPI_FIFOSTAT_FIFOSTAT_Pos) /*!< Bit mask of FIFOSTAT field. */

/* Register: QSPI_DEFMEM */
/* Description: Default memory register. SPI MEM Default memory register. Fields adn content equivalent to IFCONFIG0. */

/* Bits 31..0 : Default memory register. */
#define QSPI_DEFMEM_DEFMEM_Pos (0UL) /*!< Position of DEFMEM field. */
#define QSPI_DEFMEM_DEFMEM_Msk (0xFFFFFFFFUL << QSPI_DEFMEM_DEFMEM_Pos) /*!< Bit mask of DEFMEM field. */

/* Register: QSPI_ADDRCONFIG */
/* Description: Extended address configuration. SPI MEM CTRL Extended Addressing Mode reg. */

/* Bit 27 : Send WREN(write enable opcode 0x06) before instruction. */
#define QSPI_ADDRCONFIG_WREN_Pos (27UL) /*!< Position of WREN field. */
#define QSPI_ADDRCONFIG_WREN_Msk (0x1UL << QSPI_ADDRCONFIG_WREN_Pos) /*!< Bit mask of WREN field. */
#define QSPI_ADDRCONFIG_WREN_Disable (0UL) /*!< Do not send WREN. */
#define QSPI_ADDRCONFIG_WREN_Enable (1UL) /*!< Send WREN. */

/* Bit 26 : Wait for "write complete" before sending command. */
#define QSPI_ADDRCONFIG_WIPWAIT_Pos (26UL) /*!< Position of WIPWAIT field. */
#define QSPI_ADDRCONFIG_WIPWAIT_Msk (0x1UL << QSPI_ADDRCONFIG_WIPWAIT_Pos) /*!< Bit mask of WIPWAIT field. */
#define QSPI_ADDRCONFIG_WIPWAIT_Disable (0UL) /*!< No wait. */
#define QSPI_ADDRCONFIG_WIPWAIT_Enable (1UL) /*!< Wait. */

/* Bits 25..24 : Extended addressing mode. */
#define QSPI_ADDRCONFIG_MODE_Pos (24UL) /*!< Position of MODE field. */
#define QSPI_ADDRCONFIG_MODE_Msk (0x3UL << QSPI_ADDRCONFIG_MODE_Pos) /*!< Bit mask of MODE field. */
#define QSPI_ADDRCONFIG_MODE_NoInstr (0UL) /*!< Do not send any instruction. */
#define QSPI_ADDRCONFIG_MODE_Opcode (1UL) /*!< Send opcode. */
#define QSPI_ADDRCONFIG_MODE_OpByte0 (2UL) /*!< Send opcode, byte0. */
#define QSPI_ADDRCONFIG_MODE_All (3UL) /*!< Send opcode, byte0, byte1. */

