jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 31..26 : USB 48 MHz ring oscillator trim codes. */
#define FICR_CHIPCONF04_USBPLL_CALIB_ROSC_Pos (26UL) /*!< Position of USBPLL_CALIB_ROSC field. */
#define FICR_CHIPCONF04_USBPLL_CALIB_ROSC_Msk (0x3FUL << FICR_CHIPCONF04_USBPLL_CALIB_ROSC_Pos) /*!< Bit mask of USBPLL_CALIB_ROSC field. */

/* Bits 22..21 : 32kHz ULP RC oscillator calibration length */
#define FICR_CHIPCONF04_RCOSC32KIULPCALLENGTH_Pos (21UL) /*!< Position of RCOSC32KIULPCALLENGTH field. */
#define FICR_CHIPCONF04_RCOSC32KIULPCALLENGTH_Msk (0x3UL << FICR_CHIPCONF04_RCOSC32KIULPCALLENGTH_Pos) /*!< Bit mask of RCOSC32KIULPCALLENGTH field. */

/* Bits 13..9 : Calibrate internal bandgap reference in COMP */
#define FICR_CHIPCONF04_COMPREFTRIM_Pos (9UL) /*!< Position of COMPREFTRIM field. */
#define FICR_CHIPCONF04_COMPREFTRIM_Msk (0x1FUL << FICR_CHIPCONF04_COMPREFTRIM_Pos) /*!< Bit mask of COMPREFTRIM field. */

/* Bits 5..0 : 32.678 kHz ULP RC oscillator trim code */
#define FICR_CHIPCONF04_RCOSC32KIULPTRIM_Pos (0UL) /*!< Position of RCOSC32KIULPTRIM field. */
#define FICR_CHIPCONF04_RCOSC32KIULPTRIM_Msk (0x3FUL << FICR_CHIPCONF04_RCOSC32KIULPTRIM_Pos) /*!< Bit mask of RCOSC32KIULPTRIM field. */

/* Register: FICR_CHIPCONF05 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bits 30..28 : VREG DVDD Output voltage calibration */
#define FICR_CHIPCONF05_VREG_DVDD_TRIM_Pos (28UL) /*!< Position of VREG_DVDD_TRIM field. */
#define FICR_CHIPCONF05_VREG_DVDD_TRIM_Msk (0x7UL << FICR_CHIPCONF05_VREG_DVDD_TRIM_Pos) /*!< Bit mask of VREG_DVDD_TRIM field. */
#define FICR_CHIPCONF05_VREG_DVDD_TRIM_0 (0UL) /*!< default voltage */

/* Bit 24 : Enable or disable the feature */
#define FICR_CHIPCONF05_VREG_DVDD_HIGH_Pos (24UL) /*!< Position of VREG_DVDD_HIGH field. */
#define FICR_CHIPCONF05_VREG_DVDD_HIGH_Msk (0x1UL << FICR_CHIPCONF05_VREG_DVDD_HIGH_Pos) /*!< Bit mask of VREG_DVDD_HIGH field. */
#define FICR_CHIPCONF05_VREG_DVDD_HIGH_Disabled (0UL) /*!< Nominal output levels of VREG_DVDD LDO */
#define FICR_CHIPCONF05_VREG_DVDD_HIGH_Enabled (1UL) /*!< Increased output levels of VREG_DVDD LDO */

/* Bits 23..21 : VREG AVDD Output voltage calibration */
#define FICR_CHIPCONF05_VREG_AVDD_TRIM_Pos (21UL) /*!< Position of VREG_AVDD_TRIM field. */
#define FICR_CHIPCONF05_VREG_AVDD_TRIM_Msk (0x7UL << FICR_CHIPCONF05_VREG_AVDD_TRIM_Pos) /*!< Bit mask of VREG_AVDD_TRIM field. */
#define FICR_CHIPCONF05_VREG_AVDD_TRIM_0 (0UL) /*!< default voltage */

/* Bits 17..16 : BUCK_DVDD Output voltage selection. */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_Pos (16UL) /*!< Position of BUCK_DVDD_VOLTAGE field. */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_Msk (0x3UL << FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_Pos) /*!< Bit mask of BUCK_DVDD_VOLTAGE field. */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_1V00 (0UL) /*!< 1.00 V */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_1V09 (1UL) /*!< 1.09 V */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_1V17 (2UL) /*!< 1.17 V */
#define FICR_CHIPCONF05_BUCK_DVDD_VOLTAGE_1V26 (3UL) /*!< 1.26 V */

/* Bits 15..14 : BUCK DVDD Input clock selection. */
#define FICR_CHIPCONF05_BUCK_DVDD_CKSEL_Pos (14UL) /*!< Position of BUCK_DVDD_CKSEL field. */
#define FICR_CHIPCONF05_BUCK_DVDD_CKSEL_Msk (0x3UL << FICR_CHIPCONF05_BUCK_DVDD_CKSEL_Pos) /*!< Bit mask of BUCK_DVDD_CKSEL field. */
#define FICR_CHIPCONF05_BUCK_DVDD_CKSEL_NORMAL (0UL) /*!< normal clock */
#define FICR_CHIPCONF05_BUCK_DVDD_CKSEL_INVERTED (1UL) /*!< inverted clock */

/* Bits 13..9 : BUCK DVDD output voltage calibration */
#define FICR_CHIPCONF05_BUCK_DVDD_CAL_Pos (9UL) /*!< Position of BUCK_DVDD_CAL field. */
#define FICR_CHIPCONF05_BUCK_DVDD_CAL_Msk (0x1FUL << FICR_CHIPCONF05_BUCK_DVDD_CAL_Pos) /*!< Bit mask of BUCK_DVDD_CAL field. */

/* Bits 8..7 : Output voltage selection. */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_Pos (7UL) /*!< Position of BUCK_AVDD_VOLTAGE field. */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_Msk (0x3UL << FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_Pos) /*!< Bit mask of BUCK_AVDD_VOLTAGE field. */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_1V00 (0UL) /*!< 1.00 V */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_1V09 (1UL) /*!< 1.09 V */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_1V17 (2UL) /*!< 1.17 V */
#define FICR_CHIPCONF05_BUCK_AVDD_VOLTAGE_1V26 (3UL) /*!< 1.26 V */

/* Bits 6..5 : BUCK AVDD Input clock selection. */
#define FICR_CHIPCONF05_BUCK_AVDD_CKSEL_Pos (5UL) /*!< Position of BUCK_AVDD_CKSEL field. */
#define FICR_CHIPCONF05_BUCK_AVDD_CKSEL_Msk (0x3UL << FICR_CHIPCONF05_BUCK_AVDD_CKSEL_Pos) /*!< Bit mask of BUCK_AVDD_CKSEL field. */
#define FICR_CHIPCONF05_BUCK_AVDD_CKSEL_NORMAL (0UL) /*!< normal clock */
#define FICR_CHIPCONF05_BUCK_AVDD_CKSEL_INVERTED (1UL) /*!< inverted clock */

/* Bits 4..0 : BUCK AVDD output voltage calibration */
#define FICR_CHIPCONF05_BUCK_AVDD_CAL_Pos (0UL) /*!< Position of BUCK_AVDD_CAL field. */
#define FICR_CHIPCONF05_BUCK_AVDD_CAL_Msk (0x1FUL << FICR_CHIPCONF05_BUCK_AVDD_CAL_Pos) /*!< Bit mask of BUCK_AVDD_CAL field. */

/* Register: FICR_CHIPCONF06 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bits 13..11 : VREG USB Output voltage calibration */
#define FICR_CHIPCONF06_VREGUSB_TRIM_Pos (11UL) /*!< Position of VREGUSB_TRIM field. */
#define FICR_CHIPCONF06_VREGUSB_TRIM_Msk (0x7UL << FICR_CHIPCONF06_VREGUSB_TRIM_Pos) /*!< Bit mask of VREGUSB_TRIM field. */
#define FICR_CHIPCONF06_VREGUSB_TRIM_0 (0UL) /*!< min voltage */
#define FICR_CHIPCONF06_VREGUSB_TRIM_7 (7UL) /*!< max voltage */

/* Bits 10..9 : VREG USB Configuration */
#define FICR_CHIPCONF06_VREGUSB_CFG_Pos (9UL) /*!< Position of VREGUSB_CFG field. */
#define FICR_CHIPCONF06_VREGUSB_CFG_Msk (0x3UL << FICR_CHIPCONF06_VREGUSB_CFG_Pos) /*!< Bit mask of VREGUSB_CFG field. */

/* Bit 8 : Ignore Reday Signal from Analog part */
#define FICR_CHIPCONF06_IGNORE_ANA_READY_SIGNALS_Pos (8UL) /*!< Position of IGNORE_ANA_READY_SIGNALS field. */
#define FICR_CHIPCONF06_IGNORE_ANA_READY_SIGNALS_Msk (0x1UL << FICR_CHIPCONF06_IGNORE_ANA_READY_SIGNALS_Pos) /*!< Bit mask of IGNORE_ANA_READY_SIGNALS field. */
#define FICR_CHIPCONF06_IGNORE_ANA_READY_SIGNALS_1 (0UL) /*!< Power regulator control waits for analog ready signals (normal mode) */
#define FICR_CHIPCONF06_IGNORE_ANA_READY_SIGNALS_0 (1UL) /*!< Power regulator control does not wait for analog ready signals (backdoor) */

/* Bit 7 : Disable Regulator to Force Clock */
#define FICR_CHIPCONF06_DISABLE_REGULATOR_CK_FORCE_Pos (7UL) /*!< Position of DISABLE_REGULATOR_CK_FORCE field. */
#define FICR_CHIPCONF06_DISABLE_REGULATOR_CK_FORCE_Msk (0x1UL << FICR_CHIPCONF06_DISABLE_REGULATOR_CK_FORCE_Pos) /*!< Bit mask of DISABLE_REGULATOR_CK_FORCE field. */
#define FICR_CHIPCONF06_DISABLE_REGULATOR_CK_FORCE_0 (0UL) /*!< Power regulator control requests clock constantly (backdoor) */
#define FICR_CHIPCONF06_DISABLE_REGULATOR_CK_FORCE_1 (1UL) /*!< Power regulator control requests clock automatically when it needs it (normal mode) */

