jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 6..4 : VREG ULP DVDD Output voltage calibration */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_TRIM_Pos (4UL) /*!< Position of VREG_ULP_DVDD_TRIM field. */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_TRIM_Msk (0x7UL << FICR_CHIPCONF06_VREG_ULP_DVDD_TRIM_Pos) /*!< Bit mask of VREG_ULP_DVDD_TRIM field. */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_TRIM_0 (0UL) /*!< min voltage */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_TRIM_7 (7UL) /*!< max voltage */

/* Bit 3 : Enable or disable the feature */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_HIGH_Pos (3UL) /*!< Position of VREG_ULP_DVDD_HIGH field. */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_HIGH_Msk (0x1UL << FICR_CHIPCONF06_VREG_ULP_DVDD_HIGH_Pos) /*!< Bit mask of VREG_ULP_DVDD_HIGH field. */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_HIGH_Disabled (0UL) /*!< Nominal output levels of VREG_ULP_DVDD LDO */
#define FICR_CHIPCONF06_VREG_ULP_DVDD_HIGH_Enabled (1UL) /*!< Increased output levels of VREG_ULP_DVDD LDO */

/* Bits 2..0 : VREG ULP AVDD Output voltage calibration */
#define FICR_CHIPCONF06_VREG_ULP_AVDD_TRIM_Pos (0UL) /*!< Position of VREG_ULP_AVDD_TRIM field. */
#define FICR_CHIPCONF06_VREG_ULP_AVDD_TRIM_Msk (0x7UL << FICR_CHIPCONF06_VREG_ULP_AVDD_TRIM_Pos) /*!< Bit mask of VREG_ULP_AVDD_TRIM field. */
#define FICR_CHIPCONF06_VREG_ULP_AVDD_TRIM_0 (0UL) /*!< min voltage */
#define FICR_CHIPCONF06_VREG_ULP_AVDD_TRIM_7 (7UL) /*!< max voltage */

/* Register: FICR_FLASHPWRUP0 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP0_FLASHPWRUP0_Pos (0UL) /*!< Position of FLASHPWRUP0 field. */
#define FICR_FLASHPWRUP0_FLASHPWRUP0_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP0_FLASHPWRUP0_Pos) /*!< Bit mask of FLASHPWRUP0 field. */

/* Register: FICR_FLASHPWRUP1 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP1_FLASHPWRUP1_Pos (0UL) /*!< Position of FLASHPWRUP1 field. */
#define FICR_FLASHPWRUP1_FLASHPWRUP1_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP1_FLASHPWRUP1_Pos) /*!< Bit mask of FLASHPWRUP1 field. */

/* Register: FICR_FLASHPWRUP2 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP2_FLASHPWRUP2_Pos (0UL) /*!< Position of FLASHPWRUP2 field. */
#define FICR_FLASHPWRUP2_FLASHPWRUP2_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP2_FLASHPWRUP2_Pos) /*!< Bit mask of FLASHPWRUP2 field. */

/* Register: FICR_FLASHPWRUP3 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP3_FLASHPWRUP3_Pos (0UL) /*!< Position of FLASHPWRUP3 field. */
#define FICR_FLASHPWRUP3_FLASHPWRUP3_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP3_FLASHPWRUP3_Pos) /*!< Bit mask of FLASHPWRUP3 field. */

/* Register: FICR_RAM */
/* Description: RAM variant */

/* Bits 31..0 : RAM variant */
#define FICR_RAM_RAM_Pos (0UL) /*!< Position of RAM field. */
#define FICR_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_RAM_RAM_Pos) /*!< Bit mask of RAM field. */
#define FICR_RAM_RAM_K16 (0x10UL) /*!< 16 kByte RAM */
#define FICR_RAM_RAM_K32 (0x20UL) /*!< 32 kByte RAM */
#define FICR_RAM_RAM_K64 (0x40UL) /*!< 64 kByte RAM */
#define FICR_RAM_RAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified */

/* Register: FICR_FLASH */
/* Description: Flash variant */

/* Bits 31..0 : Flash variant */
#define FICR_FLASH_FLASH_Pos (0UL) /*!< Position of FLASH field. */
#define FICR_FLASH_FLASH_Msk (0xFFFFFFFFUL << FICR_FLASH_FLASH_Pos) /*!< Bit mask of FLASH field. */
#define FICR_FLASH_FLASH_K128 (0x80UL) /*!< 128 kByte FLASH */
#define FICR_FLASH_FLASH_K256 (0x100UL) /*!< 256 kByte FLASH */
#define FICR_FLASH_FLASH_K512 (0x200UL) /*!< 512 kByte FLASH */
#define FICR_FLASH_FLASH_K1024 (0x400UL) /*!< 1 MByte FLASH */
#define FICR_FLASH_FLASH_Unspecified (0xFFFFFFFFUL) /*!< Unspecified */

/* Register: FICR_TESTSTATUS */
/* Description: Code memory test status. Will be set during production test. */

/* Bits 31..0 : Code memory test status. Will be set during production test. */
#define FICR_TESTSTATUS_TESTSTATUS_Pos (0UL) /*!< Position of TESTSTATUS field. */
#define FICR_TESTSTATUS_TESTSTATUS_Msk (0xFFFFFFFFUL << FICR_TESTSTATUS_TESTSTATUS_Pos) /*!< Bit mask of TESTSTATUS field. */

/* Register: FICR_CPTEST0 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST0_CP1_Pos (0UL) /*!< Position of CP1 field. */
#define FICR_CPTEST0_CP1_Msk (0xFFFFFFFFUL << FICR_CPTEST0_CP1_Pos) /*!< Bit mask of CP1 field. */

/* Register: FICR_CPTEST00 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST00_CP1_Pos (0UL) /*!< Position of CP1 field. */
#define FICR_CPTEST00_CP1_Msk (0xFFFFFFFFUL << FICR_CPTEST00_CP1_Pos) /*!< Bit mask of CP1 field. */

/* Register: FICR_CPTEST1 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : 4th ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID4_Pos (24UL) /*!< Position of LOTID4 field. */
#define FICR_CPTEST1_LOTID4_Msk (0xFFUL << FICR_CPTEST1_LOTID4_Pos) /*!< Bit mask of LOTID4 field. */

/* Bits 23..16 : 3rd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID3_Pos (16UL) /*!< Position of LOTID3 field. */
#define FICR_CPTEST1_LOTID3_Msk (0xFFUL << FICR_CPTEST1_LOTID3_Pos) /*!< Bit mask of LOTID3 field. */

/* Bits 15..8 : 2nd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID2_Pos (8UL) /*!< Position of LOTID2 field. */
#define FICR_CPTEST1_LOTID2_Msk (0xFFUL << FICR_CPTEST1_LOTID2_Pos) /*!< Bit mask of LOTID2 field. */

/* Bits 7..0 : 1st ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID1_Pos (0UL) /*!< Position of LOTID1 field. */
#define FICR_CPTEST1_LOTID1_Msk (0xFFUL << FICR_CPTEST1_LOTID1_Pos) /*!< Bit mask of LOTID1 field. */

/* Register: FICR_CPTEST2 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : Device X-coordinate, always &gt;=0, offset so that the leftmost value on wafer is 0 */
#define FICR_CPTEST2_XCOORD_Pos (24UL) /*!< Position of XCOORD field. */
#define FICR_CPTEST2_XCOORD_Msk (0xFFUL << FICR_CPTEST2_XCOORD_Pos) /*!< Bit mask of XCOORD field. */

/* Bits 23..16 : Wafer number, 1 byte integer */
#define FICR_CPTEST2_WAFER_Pos (16UL) /*!< Position of WAFER field. */
#define FICR_CPTEST2_WAFER_Msk (0xFFUL << FICR_CPTEST2_WAFER_Pos) /*!< Bit mask of WAFER field. */

/* Bits 15..8 : 6th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID6_Pos (8UL) /*!< Position of LOTID6 field. */
#define FICR_CPTEST2_LOTID6_Msk (0xFFUL << FICR_CPTEST2_LOTID6_Pos) /*!< Bit mask of LOTID6 field. */

/* Bits 7..0 : 5th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID5_Pos (0UL) /*!< Position of LOTID5 field. */
#define FICR_CPTEST2_LOTID5_Msk (0xFFUL << FICR_CPTEST2_LOTID5_Pos) /*!< Bit mask of LOTID5 field. */

/* Register: FICR_CPTEST3 */
/* Description: Result from Circuit Probe test */

