jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: I2S_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for TASKS_STOP */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_SUBSCRIBE_STOP_EN_Msk (0x1UL << I2S_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define I2S_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_STOP will subscribe to. */
#define I2S_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_STOP_CHIDX_Msk (0x1FUL << I2S_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_SUBSCRIBE_DMA_START_TX */
/* Description: Subscribe configuration for TASKS_DMA_START_TX */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_DMA_START_TX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_SUBSCRIBE_DMA_START_TX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_START_TX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_DMA_START_TX_EN_Disabled (0UL) /*!< Disable subscription */
#define I2S_SUBSCRIBE_DMA_START_TX_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_DMA_START_TX will subscribe to. */
#define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Msk (0x1FUL << I2S_SUBSCRIBE_DMA_START_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_SUBSCRIBE_DMA_START_RX */
/* Description: Subscribe configuration for TASKS_DMA_START_RX */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_DMA_START_RX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_SUBSCRIBE_DMA_START_RX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_START_RX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_DMA_START_RX_EN_Disabled (0UL) /*!< Disable subscription */
#define I2S_SUBSCRIBE_DMA_START_RX_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_DMA_START_RX will subscribe to. */
#define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Msk (0x1FUL << I2S_SUBSCRIBE_DMA_START_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_SUBSCRIBE_DMA_STOP_TX */
/* Description: Subscribe configuration for TASKS_DMA_STOP_TX */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_STOP_TX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Disabled (0UL) /*!< Disable subscription */
#define I2S_SUBSCRIBE_DMA_STOP_TX_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_DMA_STOP_TX will subscribe to. */
#define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Msk (0x1FUL << I2S_SUBSCRIBE_DMA_STOP_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_SUBSCRIBE_DMA_STOP_RX */
/* Description: Subscribe configuration for TASKS_DMA_STOP_RX */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Msk (0x1UL << I2S_SUBSCRIBE_DMA_STOP_RX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Disabled (0UL) /*!< Disable subscription */
#define I2S_SUBSCRIBE_DMA_STOP_RX_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_DMA_STOP_RX will subscribe to. */
#define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Msk (0x1FUL << I2S_SUBSCRIBE_DMA_STOP_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_DMA_END_TX */
/* Description: Publish configuration for EVENTS_DMA_END_TX */

/* Bit 31 :   */
#define I2S_PUBLISH_DMA_END_TX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_DMA_END_TX_EN_Msk (0x1UL << I2S_PUBLISH_DMA_END_TX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_DMA_END_TX_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_DMA_END_TX_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_DMA_END_TX will subscribe to. */
#define I2S_PUBLISH_DMA_END_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_DMA_END_TX_CHIDX_Msk (0x1FUL << I2S_PUBLISH_DMA_END_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_RXPTRUPD */
/* Description: Publish configuration for EVENTS_RXPTRUPD */

/* Bit 31 :   */
#define I2S_PUBLISH_RXPTRUPD_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_RXPTRUPD_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_RXPTRUPD_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_RXPTRUPD_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_RXPTRUPD will subscribe to. */
#define I2S_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_RXPTRUPD_CHIDX_Msk (0x1FUL << I2S_PUBLISH_RXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_STOPPED */
/* Description: Publish configuration for EVENTS_STOPPED */

/* Bit 31 :   */
#define I2S_PUBLISH_STOPPED_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_STOPPED_EN_Msk (0x1UL << I2S_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_STOPPED_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_STOPPED_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_STOPPED will subscribe to. */
#define I2S_PUBLISH_STOPPED_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_STOPPED_CHIDX_Msk (0x1FUL << I2S_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_ERROR_TX */
/* Description: Publish configuration for EVENTS_ERROR_TX */

/* Bit 31 :   */
#define I2S_PUBLISH_ERROR_TX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_ERROR_TX_EN_Msk (0x1UL << I2S_PUBLISH_ERROR_TX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_ERROR_TX_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_ERROR_TX_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_ERROR_TX will subscribe to. */
#define I2S_PUBLISH_ERROR_TX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_ERROR_TX_CHIDX_Msk (0x1FUL << I2S_PUBLISH_ERROR_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_ERROR_RX */
/* Description: Publish configuration for EVENTS_ERROR_RX */

/* Bit 31 :   */
#define I2S_PUBLISH_ERROR_RX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_ERROR_RX_EN_Msk (0x1UL << I2S_PUBLISH_ERROR_RX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_ERROR_RX_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_ERROR_RX_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_ERROR_RX will subscribe to. */
#define I2S_PUBLISH_ERROR_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_ERROR_RX_CHIDX_Msk (0x1FUL << I2S_PUBLISH_ERROR_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_TXPTRUPD */
/* Description: Publish configuration for EVENTS_TXPTRUPD */

/* Bit 31 :   */
#define I2S_PUBLISH_TXPTRUPD_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_TXPTRUPD_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_TXPTRUPD_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_TXPTRUPD_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_TXPTRUPD will subscribe to. */
#define I2S_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_TXPTRUPD_CHIDX_Msk (0x1FUL << I2S_PUBLISH_TXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_DMA_END_RX */
/* Description: Publish configuration for EVENTS_DMA_END_RX */

/* Bit 31 :   */
#define I2S_PUBLISH_DMA_END_RX_EN_Pos (31UL) /*!< Position of EN field. */
#define I2S_PUBLISH_DMA_END_RX_EN_Msk (0x1UL << I2S_PUBLISH_DMA_END_RX_EN_Pos) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_DMA_END_RX_EN_Disabled (0UL) /*!< Disable publishing */
#define I2S_PUBLISH_DMA_END_RX_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_DMA_END_RX will subscribe to. */
#define I2S_PUBLISH_DMA_END_RX_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define I2S_PUBLISH_DMA_END_RX_CHIDX_Msk (0x1FUL << I2S_PUBLISH_DMA_END_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: I2S_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 6 : Enable or disable interrupt for DMA_END_RX event */
#define I2S_INTEN_DMA_END_RX_Pos (6UL) /*!< Position of DMA_END_RX field. */
#define I2S_INTEN_DMA_END_RX_Msk (0x1UL << I2S_INTEN_DMA_END_RX_Pos) /*!< Bit mask of DMA_END_RX field. */
#define I2S_INTEN_DMA_END_RX_Disabled (0UL) /*!< Disable */
#define I2S_INTEN_DMA_END_RX_Enabled (1UL) /*!< Enable */

