jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: LPCOMP_HYST */
/* Description: Comparator hysteresis enable */

/* Bit 0 : Comparator hysteresis enable */
#define LPCOMP_HYST_HYST_Pos (0UL) /*!< Position of HYST field. */
#define LPCOMP_HYST_HYST_Msk (0x1UL << LPCOMP_HYST_HYST_Pos) /*!< Bit mask of HYST field. */
#define LPCOMP_HYST_HYST_NoHyst (0UL) /*!< Comparator hysteresis disabled */
#define LPCOMP_HYST_HYST_Hyst50mV (1UL) /*!< Comparator hysteresis disabled (typ. 50 mV) */

/* Register: LPCOMP_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define LPCOMP_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define LPCOMP_POWER_POWER_Msk (0x1UL << LPCOMP_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define LPCOMP_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define LPCOMP_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: MWU */
/* Description: Memory Watch Unit */

/* Register: MWU_PUBLISH_REGION_WA */
/* Description: Description cluster[0]:  Publish configuration for EVENTS_REGION[0].WA */

/* Bit 31 :   */
#define MWU_PUBLISH_REGION_WA_EN_Pos (31UL) /*!< Position of EN field. */
#define MWU_PUBLISH_REGION_WA_EN_Msk (0x1UL << MWU_PUBLISH_REGION_WA_EN_Pos) /*!< Bit mask of EN field. */
#define MWU_PUBLISH_REGION_WA_EN_Disabled (0UL) /*!< Disable publishing */
#define MWU_PUBLISH_REGION_WA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_REGION[0].WA will subscribe to. */
#define MWU_PUBLISH_REGION_WA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define MWU_PUBLISH_REGION_WA_CHIDX_Msk (0x1FUL << MWU_PUBLISH_REGION_WA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: MWU_PUBLISH_REGION_RA */
/* Description: Description cluster[0]:  Publish configuration for EVENTS_REGION[0].RA */

/* Bit 31 :   */
#define MWU_PUBLISH_REGION_RA_EN_Pos (31UL) /*!< Position of EN field. */
#define MWU_PUBLISH_REGION_RA_EN_Msk (0x1UL << MWU_PUBLISH_REGION_RA_EN_Pos) /*!< Bit mask of EN field. */
#define MWU_PUBLISH_REGION_RA_EN_Disabled (0UL) /*!< Disable publishing */
#define MWU_PUBLISH_REGION_RA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_REGION[0].RA will subscribe to. */
#define MWU_PUBLISH_REGION_RA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define MWU_PUBLISH_REGION_RA_CHIDX_Msk (0x1FUL << MWU_PUBLISH_REGION_RA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: MWU_PUBLISH_PREGION_WA */
/* Description: Description cluster[0]:  Publish configuration for EVENTS_PREGION[0].WA */

/* Bit 31 :   */
#define MWU_PUBLISH_PREGION_WA_EN_Pos (31UL) /*!< Position of EN field. */
#define MWU_PUBLISH_PREGION_WA_EN_Msk (0x1UL << MWU_PUBLISH_PREGION_WA_EN_Pos) /*!< Bit mask of EN field. */
#define MWU_PUBLISH_PREGION_WA_EN_Disabled (0UL) /*!< Disable publishing */
#define MWU_PUBLISH_PREGION_WA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_PREGION[0].WA will subscribe to. */
#define MWU_PUBLISH_PREGION_WA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define MWU_PUBLISH_PREGION_WA_CHIDX_Msk (0x1FUL << MWU_PUBLISH_PREGION_WA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: MWU_PUBLISH_PREGION_RA */
/* Description: Description cluster[0]:  Publish configuration for EVENTS_PREGION[0].RA */

/* Bit 31 :   */
#define MWU_PUBLISH_PREGION_RA_EN_Pos (31UL) /*!< Position of EN field. */
#define MWU_PUBLISH_PREGION_RA_EN_Msk (0x1UL << MWU_PUBLISH_PREGION_RA_EN_Pos) /*!< Bit mask of EN field. */
#define MWU_PUBLISH_PREGION_RA_EN_Disabled (0UL) /*!< Disable publishing */
#define MWU_PUBLISH_PREGION_RA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_PREGION[0].RA will subscribe to. */
#define MWU_PUBLISH_PREGION_RA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define MWU_PUBLISH_PREGION_RA_CHIDX_Msk (0x1FUL << MWU_PUBLISH_PREGION_RA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: MWU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 27 : Enable or disable interrupt for PREGION[1].RA event */
#define MWU_INTEN_PREGION1RA_Pos (27UL) /*!< Position of PREGION1RA field. */
#define MWU_INTEN_PREGION1RA_Msk (0x1UL << MWU_INTEN_PREGION1RA_Pos) /*!< Bit mask of PREGION1RA field. */
#define MWU_INTEN_PREGION1RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION1RA_Enabled (1UL) /*!< Enable */

/* Bit 26 : Enable or disable interrupt for PREGION[1].WA event */
#define MWU_INTEN_PREGION1WA_Pos (26UL) /*!< Position of PREGION1WA field. */
#define MWU_INTEN_PREGION1WA_Msk (0x1UL << MWU_INTEN_PREGION1WA_Pos) /*!< Bit mask of PREGION1WA field. */
#define MWU_INTEN_PREGION1WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION1WA_Enabled (1UL) /*!< Enable */

/* Bit 25 : Enable or disable interrupt for PREGION[0].RA event */
#define MWU_INTEN_PREGION0RA_Pos (25UL) /*!< Position of PREGION0RA field. */
#define MWU_INTEN_PREGION0RA_Msk (0x1UL << MWU_INTEN_PREGION0RA_Pos) /*!< Bit mask of PREGION0RA field. */
#define MWU_INTEN_PREGION0RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION0RA_Enabled (1UL) /*!< Enable */

/* Bit 24 : Enable or disable interrupt for PREGION[0].WA event */
#define MWU_INTEN_PREGION0WA_Pos (24UL) /*!< Position of PREGION0WA field. */
#define MWU_INTEN_PREGION0WA_Msk (0x1UL << MWU_INTEN_PREGION0WA_Pos) /*!< Bit mask of PREGION0WA field. */
#define MWU_INTEN_PREGION0WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_PREGION0WA_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for REGION[3].RA event */
#define MWU_INTEN_REGION3RA_Pos (7UL) /*!< Position of REGION3RA field. */
#define MWU_INTEN_REGION3RA_Msk (0x1UL << MWU_INTEN_REGION3RA_Pos) /*!< Bit mask of REGION3RA field. */
#define MWU_INTEN_REGION3RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION3RA_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for REGION[3].WA event */
#define MWU_INTEN_REGION3WA_Pos (6UL) /*!< Position of REGION3WA field. */
#define MWU_INTEN_REGION3WA_Msk (0x1UL << MWU_INTEN_REGION3WA_Pos) /*!< Bit mask of REGION3WA field. */
#define MWU_INTEN_REGION3WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION3WA_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for REGION[2].RA event */
#define MWU_INTEN_REGION2RA_Pos (5UL) /*!< Position of REGION2RA field. */
#define MWU_INTEN_REGION2RA_Msk (0x1UL << MWU_INTEN_REGION2RA_Pos) /*!< Bit mask of REGION2RA field. */
#define MWU_INTEN_REGION2RA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION2RA_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for REGION[2].WA event */
#define MWU_INTEN_REGION2WA_Pos (4UL) /*!< Position of REGION2WA field. */
#define MWU_INTEN_REGION2WA_Msk (0x1UL << MWU_INTEN_REGION2WA_Pos) /*!< Bit mask of REGION2WA field. */
#define MWU_INTEN_REGION2WA_Disabled (0UL) /*!< Disable */
#define MWU_INTEN_REGION2WA_Enabled (1UL) /*!< Enable */

