jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: NFCT_DEFAULTSTATESLEEP */
/* Description: Reflects the default state during automatic collision resolution */

/* Bit 0 : Reflects the default state during automatic collision resolution. Affected by the GOIDLE and GOSLEEP tasks. */
#define NFCT_DEFAULTSTATESLEEP_DEFAULTSTATESLEEP_Pos (0UL) /*!< Position of DEFAULTSTATESLEEP field. */
#define NFCT_DEFAULTSTATESLEEP_DEFAULTSTATESLEEP_Msk (0x1UL << NFCT_DEFAULTSTATESLEEP_DEFAULTSTATESLEEP_Pos) /*!< Bit mask of DEFAULTSTATESLEEP field. */
#define NFCT_DEFAULTSTATESLEEP_DEFAULTSTATESLEEP_Idle (0UL) /*!< Default state is IDLE */
#define NFCT_DEFAULTSTATESLEEP_DEFAULTSTATESLEEP_SleepA (1UL) /*!< Default state is SLEEP_A */

/* Register: NFCT_BYTESWRITTENTORAM */
/* Description: Number of bytes written to RAM */

/* Bits 8..0 : Number of bytes written to RAM. */
#define NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Pos (0UL) /*!< Position of BYTESWRITTENTORAM field. */
#define NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Msk (0x1FFUL << NFCT_BYTESWRITTENTORAM_BYTESWRITTENTORAM_Pos) /*!< Bit mask of BYTESWRITTENTORAM field. */

/* Register: NFCT_NFCFRAMINGCORESTATE */
/* Description: NFC Framing Core State */

/* Bits 2..0 : Current NFC Framing Core State */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Pos (0UL) /*!< Position of NFCFRAMINGCORESTATE field. */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Msk (0x7UL << NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Pos) /*!< Bit mask of NFCFRAMINGCORESTATE field. */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_PadNotConnected (0x00UL) /*!< NFC pads not connected */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Disabled (0x01UL) /*!< NFC peripheral disabled */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Sense (0x02UL) /*!< In sense state. But it is transitive state, so visible for one peripheral clock cycle only. */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_RampUp (0x03UL) /*!< NFC peripheral ramping up */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_CollisionResolution (0x04UL) /*!< Automatic collision resolution in progress */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Selected (0x05UL) /*!< In selected state */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_Transmitting (0x06UL) /*!< Transmit in progress */
#define NFCT_NFCFRAMINGCORESTATE_NFCFRAMINGCORESTATE_TransmitFinishing (0x07UL) /*!< Transmit finishing, reading from the RAM buffer completed */

/* Register: NFCT_NFCANTICOLRESSTATE */
/* Description: Automatic collision resolution (anti-collision) state */

/* Bits 3..0 : Current Automatic collision resolution (anti-collision) state */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Pos (0UL) /*!< Position of NFCANTICOLRESSTATE field. */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Msk (0xFUL << NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_Pos) /*!< Bit mask of NFCANTICOLRESSTATE field. */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_IDLE (0x00UL) /*!< State IDLE */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_IDLE_SENS_RES (0x01UL) /*!< State IDLE_SENS_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0 (0x02UL) /*!< State READY_A0 */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0_SEL_RES (0x03UL) /*!< State READY_A0_SEL_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A0_SDD_RES (0x04UL) /*!< State READY_A0_SDD_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1 (0x05UL) /*!< State READY_A1 */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1_SEL_RES (0x06UL) /*!< State READY_A1_SEL_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A1_SDD_RES (0x07UL) /*!< State READY_A1_SDD_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2 (0x08UL) /*!< State READY_A2 */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2_SEL_RES (0x09UL) /*!< State READY_A2_SEL_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_READY_A2_SDD_RES (0x0AUL) /*!< State READY_A2_SDD_RES */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_ACTIVE_A (0x0BUL) /*!< State ACTIVE_A */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_SLEEP_A (0x0CUL) /*!< State SLEEP_A */
#define NFCT_NFCANTICOLRESSTATE_NFCANTICOLRESSTATE_SLEEP_A_SENS_RES (0x0DUL) /*!< State SLEEP_A_SENS_RES */

/* Register: NFCT_MEASUREDFREQ */
/* Description: The frequency measured on the 13.56 MHz NFC carrier signal */

/* Bits 10..0 : The frequency measured on the 13.56 MHz NFC carrier signal. This result is produced in response to triggering FREQMEASURE. Frequency = 16 MHz * MEASUREDFREQ / 1000 */
#define NFCT_MEASUREDFREQ_MEASUREDFREQ_Pos (0UL) /*!< Position of MEASUREDFREQ field. */
#define NFCT_MEASUREDFREQ_MEASUREDFREQ_Msk (0x7FFUL << NFCT_MEASUREDFREQ_MEASUREDFREQ_Pos) /*!< Bit mask of MEASUREDFREQ field. */

/* Register: NFCT_ROSCCALVALUE */
/* Description: The current value used by the ring oscillator */

/* Bits 4..0 : The current value used by the ring oscillator. Either given by the calibration engine, or by the override value. */
#define NFCT_ROSCCALVALUE_ROSCCALVALUE_Pos (0UL) /*!< Position of ROSCCALVALUE field. */
#define NFCT_ROSCCALVALUE_ROSCCALVALUE_Msk (0x1FUL << NFCT_ROSCCALVALUE_ROSCCALVALUE_Pos) /*!< Bit mask of ROSCCALVALUE field. */
#define NFCT_ROSCCALVALUE_ROSCCALVALUE_Minimum (0x00UL) /*!< Minimum frequency */
#define NFCT_ROSCCALVALUE_ROSCCALVALUE_Nominal (0x0FUL) /*!< Nominal frequency */
#define NFCT_ROSCCALVALUE_ROSCCALVALUE_Maximum (0x1FUL) /*!< Maximum frequency */

/* Register: NFCT_FIELDPRESENT */
/* Description: Indicates the presence or not of a valid field */

/* Bit 1 : Indicates if the low level has locked to the field */
#define NFCT_FIELDPRESENT_LOCKDETECT_Pos (1UL) /*!< Position of LOCKDETECT field. */
#define NFCT_FIELDPRESENT_LOCKDETECT_Msk (0x1UL << NFCT_FIELDPRESENT_LOCKDETECT_Pos) /*!< Bit mask of LOCKDETECT field. */
#define NFCT_FIELDPRESENT_LOCKDETECT_NotLocked (0UL) /*!< Not locked to field */
#define NFCT_FIELDPRESENT_LOCKDETECT_Locked (1UL) /*!< Locked to field */

/* Bit 0 : Indicates the presence or not of a valid field. Available only in the activated state. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_Pos (0UL) /*!< Position of FIELDPRESENT field. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_Msk (0x1UL << NFCT_FIELDPRESENT_FIELDPRESENT_Pos) /*!< Bit mask of FIELDPRESENT field. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_NoField (0UL) /*!< No valid field detected */
#define NFCT_FIELDPRESENT_FIELDPRESENT_FieldPresent (1UL) /*!< Valid field detected */

/* Register: NFCT_CURRENTPEAKDETECTREF */
/* Description: Current peak detect reference */

