jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bit 0 : Override enable for OVERRIDE_PWRUP */
#define NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos (0UL) /*!< Position of OVRENPWRUP field. */
#define NFCT_OVERRIDEENABLE_OVRENPWRUP_Msk (0x1UL << NFCT_OVERRIDEENABLE_OVRENPWRUP_Pos) /*!< Bit mask of OVRENPWRUP field. */

/* Register: NFCT_OVRVALPWRUPNFC */
/* Description: Override value for pwrupNfc */

/* Bits 1..0 : Override value for pwrupNfc */
#define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos (0UL) /*!< Position of OVRVALPWRUPNFC field. */
#define NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Msk (0x3UL << NFCT_OVRVALPWRUPNFC_OVRVALPWRUPNFC_Pos) /*!< Bit mask of OVRVALPWRUPNFC field. */

/* Register: NFCT_OVRVALMODULATION */
/* Description: Override value for modulation on/off */

/* Bit 0 : Override value for modulation on/off */
#define NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos (0UL) /*!< Position of OVRVALMODULATION field. */
#define NFCT_OVRVALMODULATION_OVRVALMODULATION_Msk (0x1UL << NFCT_OVRVALMODULATION_OVRVALMODULATION_Pos) /*!< Bit mask of OVRVALMODULATION field. */

/* Register: NFCT_OVRVALLOADINACTIVE */
/* Description: Override value for the load control when modulation is off */

/* Bits 5..0 : Override value for the load control when modulation is off */
#define NFCT_OVRVALLOADINACTIVE_OVRVALLOADINACTIVE_Pos (0UL) /*!< Position of OVRVALLOADINACTIVE field. */
#define NFCT_OVRVALLOADINACTIVE_OVRVALLOADINACTIVE_Msk (0x3FUL << NFCT_OVRVALLOADINACTIVE_OVRVALLOADINACTIVE_Pos) /*!< Bit mask of OVRVALLOADINACTIVE field. */

/* Register: NFCT_OVRVALLOADACTIVE */
/* Description: Override value for the load control when modulation is on */

/* Bits 5..0 : Override value for the load control when modulation is on */
#define NFCT_OVRVALLOADACTIVE_OVRVALLOADACTIVE_Pos (0UL) /*!< Position of OVRVALLOADACTIVE field. */
#define NFCT_OVRVALLOADACTIVE_OVRVALLOADACTIVE_Msk (0x3FUL << NFCT_OVRVALLOADACTIVE_OVRVALLOADACTIVE_Pos) /*!< Bit mask of OVRVALLOADACTIVE field. */

/* Register: NFCT_OVRVALPWRUPRES */
/* Description: Override value for power up resistor in the analog pad */

/* Bit 0 : Override value for power up resistor in the analog pad */
#define NFCT_OVRVALPWRUPRES_OVRVALPWRUPRES_Pos (0UL) /*!< Position of OVRVALPWRUPRES field. */
#define NFCT_OVRVALPWRUPRES_OVRVALPWRUPRES_Msk (0x1UL << NFCT_OVRVALPWRUPRES_OVRVALPWRUPRES_Pos) /*!< Bit mask of OVRVALPWRUPRES field. */

/* Register: NFCT_OVRVALROSCCALCODE */
/* Description: Override value for the calibration word for the oscillator */

/* Bits 4..0 : Override value for the calibration word for the oscillator */
#define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos (0UL) /*!< Position of OVRVALROSCCALCODE field. */
#define NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Msk (0x1FUL << NFCT_OVRVALROSCCALCODE_OVRVALROSCCALCODE_Pos) /*!< Bit mask of OVRVALROSCCALCODE field. */

/* Register: NFCT_OVRVALROSCCALEN */
/* Description: Override value for the signal CALEN going to the oscillator */

/* Bit 0 : Override value for the calibration word for the oscillator */
#define NFCT_OVRVALROSCCALEN_OVRVALROSCCALEN_Pos (0UL) /*!< Position of OVRVALROSCCALEN field. */
#define NFCT_OVRVALROSCCALEN_OVRVALROSCCALEN_Msk (0x1UL << NFCT_OVRVALROSCCALEN_OVRVALROSCCALEN_Pos) /*!< Bit mask of OVRVALROSCCALEN field. */

/* Register: NFCT_OVRVALCLAMPEN2V2 */
/* Description: Override value for the 2V2 clamp */

/* Bit 0 : Override value for the 2V2 clamp */
#define NFCT_OVRVALCLAMPEN2V2_OVRVALCLAMPEN2V2_Pos (0UL) /*!< Position of OVRVALCLAMPEN2V2 field. */
#define NFCT_OVRVALCLAMPEN2V2_OVRVALCLAMPEN2V2_Msk (0x1UL << NFCT_OVRVALCLAMPEN2V2_OVRVALCLAMPEN2V2_Pos) /*!< Bit mask of OVRVALCLAMPEN2V2 field. */

/* Register: NFCT_OVRVALCLAMPEN3V6 */
/* Description: Override value for the 3V6 clamp */

/* Bit 0 : Override value for the 3V6 clamp */
#define NFCT_OVRVALCLAMPEN3V6_OVRVALCLAMPEN3V6_Pos (0UL) /*!< Position of OVRVALCLAMPEN3V6 field. */
#define NFCT_OVRVALCLAMPEN3V6_OVRVALCLAMPEN3V6_Msk (0x1UL << NFCT_OVRVALCLAMPEN3V6_OVRVALCLAMPEN3V6_Pos) /*!< Bit mask of OVRVALCLAMPEN3V6 field. */

/* Register: NFCT_AUTOCAL */
/* Description: Controls auto-calibration at NFCT module enabling */

/* Bit 0 : Controls auto-calibration at NFCT module enabling */
#define NFCT_AUTOCAL_ROSCEN_Pos (0UL) /*!< Position of ROSCEN field. */
#define NFCT_AUTOCAL_ROSCEN_Msk (0x1UL << NFCT_AUTOCAL_ROSCEN_Pos) /*!< Bit mask of ROSCEN field. */
#define NFCT_AUTOCAL_ROSCEN_Disabled (0UL) /*!< No auto-calibration at module enablin */
#define NFCT_AUTOCAL_ROSCEN_Enabled (1UL) /*!< Enable auto-calibration at module enabling */

/* Register: NFCT_SHUNTREGCONFIG */
/* Description: Configuration for NFCT_SHUNTREG_TSMC55N */

/* Bit 17 : Enable the CMFB offset from the CMFB circuit */
#define NFCT_SHUNTREGCONFIG_CMFBOFFSETEN_Pos (17UL) /*!< Position of CMFBOFFSETEN field. */
#define NFCT_SHUNTREGCONFIG_CMFBOFFSETEN_Msk (0x1UL << NFCT_SHUNTREGCONFIG_CMFBOFFSETEN_Pos) /*!< Bit mask of CMFBOFFSETEN field. */
#define NFCT_SHUNTREGCONFIG_CMFBOFFSETEN_Disabled (0UL) /*!< Feature disabled */
#define NFCT_SHUNTREGCONFIG_CMFBOFFSETEN_Enabled (1UL) /*!< Feature enabled */

/* Bit 16 : Enable CMFB circuit */
#define NFCT_SHUNTREGCONFIG_CMFBEN_Pos (16UL) /*!< Position of CMFBEN field. */
#define NFCT_SHUNTREGCONFIG_CMFBEN_Msk (0x1UL << NFCT_SHUNTREGCONFIG_CMFBEN_Pos) /*!< Bit mask of CMFBEN field. */
#define NFCT_SHUNTREGCONFIG_CMFBEN_Disabled (0UL) /*!< Feature disabled */
#define NFCT_SHUNTREGCONFIG_CMFBEN_Enabled (1UL) /*!< Feature enabled */

/* Bits 15..13 : Common mode reference for CMFB circuit */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_Pos (13UL) /*!< Position of CMFBCMREF field. */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_Msk (0x7UL << NFCT_SHUNTREGCONFIG_CMFBCMREF_Pos) /*!< Bit mask of CMFBCMREF field. */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_0 (0UL) /*!< 0.7 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_1 (1UL) /*!< 0.65 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_2 (2UL) /*!< 0.6 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_3 (3UL) /*!< 0.55 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_4 (4UL) /*!< 0.5 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_5 (5UL) /*!< 0.45 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_6 (6UL) /*!< 0.4 * Vdd */
#define NFCT_SHUNTREGCONFIG_CMFBCMREF_CMFBCMREF_7 (7UL) /*!< 0.35 * Vdd */

/* Bits 12..11 : Set the gate voltage on shunt NMOS */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_Pos (11UL) /*!< Position of SELOPENLOOPGATECTRL field. */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_Msk (0x3UL << NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_Pos) /*!< Bit mask of SELOPENLOOPGATECTRL field. */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_SELOPENLOOPGATECTRL_0 (0UL) /*!< Vdd */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_SELOPENLOOPGATECTRL_1 (1UL) /*!< 0.75 * Vdd */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_SELOPENLOOPGATECTRL_2 (2UL) /*!< 0.5 * Vdd */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOPGATECTRL_SELOPENLOOPGATECTRL_3 (3UL) /*!< 0mV */

/* Bit 10 : This sets the shunt regulation in open loop mode */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOP_Pos (10UL) /*!< Position of SELOPENLOOP field. */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOP_Msk (0x1UL << NFCT_SHUNTREGCONFIG_SELOPENLOOP_Pos) /*!< Bit mask of SELOPENLOOP field. */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOP_SELOPENLOOP_Disabled (0UL) /*!< Closed loop mode */
#define NFCT_SHUNTREGCONFIG_SELOPENLOOP_SELOPENLOOP_Enabled (1UL) /*!< Open loop mode */

/* Bit 9 : Reserved for future use */
#define NFCT_SHUNTREGCONFIG_RFU1_Pos (9UL) /*!< Position of RFU1 field. */
#define NFCT_SHUNTREGCONFIG_RFU1_Msk (0x1UL << NFCT_SHUNTREGCONFIG_RFU1_Pos) /*!< Bit mask of RFU1 field. */

/* Bits 8..7 : Peak detector common mode voltage tuning */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_Pos (7UL) /*!< Position of PEAKDETECTORCMVOLTAGE field. */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_Msk (0x3UL << NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_Pos) /*!< Bit mask of PEAKDETECTORCMVOLTAGE field. */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_PEAKDETECTORCMVOLTAGE_0 (0UL) /*!< 120mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_PEAKDETECTORCMVOLTAGE_1 (1UL) /*!< 80mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_PEAKDETECTORCMVOLTAGE_2 (2UL) /*!< 40mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTORCMVOLTAGE_PEAKDETECTORCMVOLTAGE_3 (3UL) /*!< 0mV */

