jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 6..4 : Initial peak detect reference value */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_Pos (4UL) /*!< Position of PEAKDETECTREFINIT field. */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_Msk (0x7UL << NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_Pos) /*!< Bit mask of PEAKDETECTREFINIT field. */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_0 (0UL) /*!< 1040 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_1 (1UL) /*!< 1000 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_2 (2UL) /*!< 960 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_3 (3UL) /*!< 920 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_4 (4UL) /*!< 880 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_5 (5UL) /*!< 840 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_6 (6UL) /*!< 800 mV */
#define NFCT_SHUNTREGCONFIG_PEAKDETECTREFINIT_PEAKDETECTREFINIT_7 (7UL) /*!< 760 mV */

/* Bits 3..2 : Capacitance tuning in peak detection block for swing programmability. The C1 and C2 are coming from, Vpeak-swing = Vref * ((C1 + C2) / C1),  Vpeak-swing is NFC swing, Vref is from PEAKDETECTREFINIT */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_Pos (2UL) /*!< Position of PEAKKDETECTCAPTUNE field. */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_Msk (0x3UL << NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_Pos) /*!< Bit mask of PEAKKDETECTCAPTUNE field. */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_PEAKKDETECTCAPTUNE_0 (0UL) /*!< C2=96fF,C1=266fF */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_PEAKKDETECTCAPTUNE_1 (1UL) /*!< C2=116fF,C1=266fF (highest swing) */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_PEAKKDETECTCAPTUNE_2 (2UL) /*!< C2=22fF,C1=266fF (lowest swing) */
#define NFCT_SHUNTREGCONFIG_PEAKKDETECTCAPTUNE_PEAKKDETECTCAPTUNE_3 (3UL) /*!< C2=52fF,C1=266fF */

/* Bits 1..0 : Reserved for future use */
#define NFCT_SHUNTREGCONFIG_RFU_Pos (0UL) /*!< Position of RFU field. */
#define NFCT_SHUNTREGCONFIG_RFU_Msk (0x3UL << NFCT_SHUNTREGCONFIG_RFU_Pos) /*!< Bit mask of RFU field. */

/* Register: NFCT_LOADMODCONFIG */
/* Description: Configuration for load modulation */

/* Bits 11..6 : Load modulation value when modulation is on */
#define NFCT_LOADMODCONFIG_LOADMODCONFIGON_Pos (6UL) /*!< Position of LOADMODCONFIGON field. */
#define NFCT_LOADMODCONFIG_LOADMODCONFIGON_Msk (0x3FUL << NFCT_LOADMODCONFIG_LOADMODCONFIGON_Pos) /*!< Bit mask of LOADMODCONFIGON field. */

/* Bits 5..0 : Load modulation value when modulation is off. The value has to be 0. Changing it would give undesired results. */
#define NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Pos (0UL) /*!< Position of LOADMODCONFIGOFF field. */
#define NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Msk (0x3FUL << NFCT_LOADMODCONFIG_LOADMODCONFIGOFF_Pos) /*!< Bit mask of LOADMODCONFIGOFF field. */

/* Register: NFCT_SHUNTNMOSADJUST */
/* Description: Size adjustment for the shunt NMOS in shunt regulator */

/* Bits 1..0 : Size adjustment for shunt NMOS in shunt regulator */
#define NFCT_SHUNTNMOSADJUST_SHUNTNMOSADJUST_Pos (0UL) /*!< Position of SHUNTNMOSADJUST field. */
#define NFCT_SHUNTNMOSADJUST_SHUNTNMOSADJUST_Msk (0x3UL << NFCT_SHUNTNMOSADJUST_SHUNTNMOSADJUST_Pos) /*!< Bit mask of SHUNTNMOSADJUST field. */

/* Register: NFCT_RSHUNTCTRL */
/* Description: Adjust internal shunt resistance */

/* Bits 2..0 : Adjust internal shunt resistance */
#define NFCT_RSHUNTCTRL_RSHUNTCTRL_Pos (0UL) /*!< Position of RSHUNTCTRL field. */
#define NFCT_RSHUNTCTRL_RSHUNTCTRL_Msk (0x7UL << NFCT_RSHUNTCTRL_RSHUNTCTRL_Pos) /*!< Bit mask of RSHUNTCTRL field. */

/* Register: NFCT_OVRVALPEAKDETECTREF */
/* Description: Override value for the peak detect reference voltage */

/* Bits 2..0 : Override value for the peak detect reference voltage */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_Pos (0UL) /*!< Position of OVRVALPEAKDETECTREF field. */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_Msk (0x7UL << NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_Pos) /*!< Bit mask of OVRVALPEAKDETECTREF field. */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_0 (0UL) /*!< 1240 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_1 (1UL) /*!< 1200 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_2 (2UL) /*!< 1160 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_3 (3UL) /*!< 1120 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_4 (4UL) /*!< 1080 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_5 (5UL) /*!< 1040 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_6 (6UL) /*!< 1000 mV */
#define NFCT_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_OVRVALPEAKDETECTREF_7 (7UL) /*!< 960 mV */

/* Register: NFCT_LOCKDETECTWINDOW */
/* Description: Adjust window size on falling edge of lock detect filter used for demodulation */

/* Bits 2..0 : Adjust window size on falling edge of lock detect filter used for demodulation */
#define NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Pos (0UL) /*!< Position of LOCKDETECTWINDOW field. */
#define NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Msk (0x7UL << NFCT_LOCKDETECTWINDOW_LOCKDETECTWINDOW_Pos) /*!< Bit mask of LOCKDETECTWINDOW field. */

/* Register: NFCT_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define NFCT_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define NFCT_POWER_POWER_Msk (0x1UL << NFCT_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define NFCT_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define NFCT_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: NVMC */
/* Description: Non Volatile Memory Controller */

/* Register: NVMC_READY */
/* Description: Ready flag */

/* Bit 0 : NVMC is ready or busy */
#define NVMC_READY_READY_Pos (0UL) /*!< Position of READY field. */
#define NVMC_READY_READY_Msk (0x1UL << NVMC_READY_READY_Pos) /*!< Bit mask of READY field. */
#define NVMC_READY_READY_Busy (0UL) /*!< NVMC is busy (on-going write or erase operation) */
#define NVMC_READY_READY_Ready (1UL) /*!< NVMC is ready */

