jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: OSCILLATORS_ATECLOCK */
/* Description: Analog test bus control for clock modules */

/* Bits 2..1 : Configure connection of PLL to analog test bus */
#define OSCILLATORS_ATECLOCK_PLL_Pos (1UL) /*!< Position of PLL field. */
#define OSCILLATORS_ATECLOCK_PLL_Msk (0x3UL << OSCILLATORS_ATECLOCK_PLL_Pos) /*!< Bit mask of PLL field. */
#define OSCILLATORS_ATECLOCK_PLL_Disconnected (0UL) /*!< Disconnect */
#define OSCILLATORS_ATECLOCK_PLL_VC (1UL) /*!< Connect loop filter voltage to ATB0 */
#define OSCILLATORS_ATECLOCK_PLL_Osc32MDiv (2UL) /*!< Connect 32 MHz divided clock to ATB1 */
#define OSCILLATORS_ATECLOCK_PLL_Both (3UL) /*!< Connect both VC and Osc32MDiv */

/* Register: OSCILLATORS_XOSC32MACCPL */
/* Description: HFXO bypass mode selection. */

/* Bit 0 : HFXO bypass mode selection. */
#define OSCILLATORS_XOSC32MACCPL_XOSC32MACCPL_Pos (0UL) /*!< Position of XOSC32MACCPL field. */
#define OSCILLATORS_XOSC32MACCPL_XOSC32MACCPL_Msk (0x1UL << OSCILLATORS_XOSC32MACCPL_XOSC32MACCPL_Pos) /*!< Bit mask of XOSC32MACCPL field. */
#define OSCILLATORS_XOSC32MACCPL_XOSC32MACCPL_normal_bypass_mode (0UL) /*!< 3V square wave on XC1 */
#define OSCILLATORS_XOSC32MACCPL_XOSC32MACCPL_AC_coupled_bypass_mode (1UL) /*!< Ac-coupled clipped sine on XC1. */

/* Register: OSCILLATORS_BYPASS32KI */
/* Description: Enable or disable bypass of LFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
#define OSCILLATORS_BYPASS32KI_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_BYPASS32KI_BYPASS_Msk (0x1UL << OSCILLATORS_BYPASS32KI_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_BYPASS32KI_BYPASS_Disabled (0UL) /*!< Disable (use with Xtal or low-swing external source) */
#define OSCILLATORS_BYPASS32KI_BYPASS_Enabled (1UL) /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_POWERDOWN32KI */
/* Description: Enable/Disable forced power power down of LFXO */

/* Bit 0 : Enable/Disable forced power power down of LFXO */
#define OSCILLATORS_POWERDOWN32KI_POWERDOWN32KI_Pos (0UL) /*!< Position of POWERDOWN32KI field. */
#define OSCILLATORS_POWERDOWN32KI_POWERDOWN32KI_Msk (0x1UL << OSCILLATORS_POWERDOWN32KI_POWERDOWN32KI_Pos) /*!< Bit mask of POWERDOWN32KI field. */
#define OSCILLATORS_POWERDOWN32KI_POWERDOWN32KI_DisableForcedOFF (0UL) /*!< LFXO can be enabled if requested */
#define OSCILLATORS_POWERDOWN32KI_POWERDOWN32KI_EnableForcedOFF (1UL) /*!< LFXO cannot be enabled when requested */

/* Register: OSCILLATORS_HFQSTRT */
/* Description: TBD */

/* Bit 0 : TBD */
#define OSCILLATORS_HFQSTRT_HFQSTRT_Pos (0UL) /*!< Position of HFQSTRT field. */
#define OSCILLATORS_HFQSTRT_HFQSTRT_Msk (0x1UL << OSCILLATORS_HFQSTRT_HFQSTRT_Pos) /*!< Bit mask of HFQSTRT field. */

/* Register: OSCILLATORS_HFCTRL */
/* Description: Temporary for CLOCK HFCTRL */

/* Bit 0 : TBD */
#define OSCILLATORS_HFCTRL_HFCTRL_Pos (0UL) /*!< Position of HFCTRL field. */
#define OSCILLATORS_HFCTRL_HFCTRL_Msk (0x1UL << OSCILLATORS_HFCTRL_HFCTRL_Pos) /*!< Bit mask of HFCTRL field. */

/* Register: OSCILLATORS_BYPASS32M */
/* Description: Enable or disable bypass of HFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of HFCLK crystal oscillator with external clock source */
#define OSCILLATORS_BYPASS32M_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_BYPASS32M_BYPASS_Msk (0x1UL << OSCILLATORS_BYPASS32M_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_BYPASS32M_BYPASS_Disabled (0UL) /*!< Disable (use with Xtal or low-swing external source) */
#define OSCILLATORS_BYPASS32M_BYPASS_Enabled (1UL) /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_XOSC32MCTRL */
/* Description: Reserved for future use */

/* Bits 5..0 : Reserved for future use */
#define OSCILLATORS_XOSC32MCTRL_XOSC32MCTRL_Pos (0UL) /*!< Position of XOSC32MCTRL field. */
#define OSCILLATORS_XOSC32MCTRL_XOSC32MCTRL_Msk (0x3FUL << OSCILLATORS_XOSC32MCTRL_XOSC32MCTRL_Pos) /*!< Bit mask of XOSC32MCTRL field. */

/* Register: OSCILLATORS_BBDLL */
/* Description: BBDLL override register in case BBDLL does not behave as expected */

/* Bits 10..8 : Spare control signal for BBDLL */
#define OSCILLATORS_BBDLL_SPARE_Pos (8UL) /*!< Position of SPARE field. */
#define OSCILLATORS_BBDLL_SPARE_Msk (0x7UL << OSCILLATORS_BBDLL_SPARE_Pos) /*!< Bit mask of SPARE field. */

/* Bit 3 : Enable or Disable bypass of BBDLL clock with an external clock provided on GPIO29 */
#define OSCILLATORS_BBDLL_EXTBYPASS_Pos (3UL) /*!< Position of EXTBYPASS field. */
#define OSCILLATORS_BBDLL_EXTBYPASS_Msk (0x1UL << OSCILLATORS_BBDLL_EXTBYPASS_Pos) /*!< Bit mask of EXTBYPASS field. */
#define OSCILLATORS_BBDLL_EXTBYPASS_Disable (0UL) /*!< BBDLL is operating normally */
#define OSCILLATORS_BBDLL_EXTBYPASS_Enable (1UL) /*!< BBDLL output clock is replaced by an external clock provided at GPIO29 */

/* Bit 2 : Turn on or off the BBDLL clock output */
#define OSCILLATORS_BBDLL_MUTE_Pos (2UL) /*!< Position of MUTE field. */
#define OSCILLATORS_BBDLL_MUTE_Msk (0x1UL << OSCILLATORS_BBDLL_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_BBDLL_MUTE_False (0UL) /*!< BBDLL clock is not muted */
#define OSCILLATORS_BBDLL_MUTE_True (1UL) /*!< BBDLL clock is muted */

/* Bit 1 : Control BBDLL Lock behaviour */
#define OSCILLATORS_BBDLL_FORCEINLOCK_Pos (1UL) /*!< Position of FORCEINLOCK field. */
#define OSCILLATORS_BBDLL_FORCEINLOCK_Msk (0x1UL << OSCILLATORS_BBDLL_FORCEINLOCK_Pos) /*!< Bit mask of FORCEINLOCK field. */
#define OSCILLATORS_BBDLL_FORCEINLOCK_False (0UL) /*!< BBDLL Lock signal is provided directly by the BBDLL oscillator */
#define OSCILLATORS_BBDLL_FORCEINLOCK_True (1UL) /*!< BBDLL Lock signal is always forced to one */

/* Bit 0 : Control BBDLL clock output */
#define OSCILLATORS_BBDLL_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_BBDLL_BYPASS_Msk (0x1UL << OSCILLATORS_BBDLL_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_BBDLL_BYPASS_False (0UL) /*!< BBDLL is operating normally */
#define OSCILLATORS_BBDLL_BYPASS_True (1UL) /*!< BBDLL output clock is replaced by HFCLK */


/* Peripheral: PAMLI */
/* Description: Peripheral AHB Multi-Layer Interface */

/* Register: PAMLI_BRIDGETYPE */
/* Description: Select AHB2AHB Sync Bridge Type */

/* Bit 1 : Select bridge type for CCM, ECB, AAR */
#define PAMLI_BRIDGETYPE_CRYPTO_Pos (1UL) /*!< Position of CRYPTO field. */
#define PAMLI_BRIDGETYPE_CRYPTO_Msk (0x1UL << PAMLI_BRIDGETYPE_CRYPTO_Pos) /*!< Bit mask of CRYPTO field. */
#define PAMLI_BRIDGETYPE_CRYPTO_Default (0UL) /*!< Select standard ARM bridge */
#define PAMLI_BRIDGETYPE_CRYPTO_Nordic (1UL) /*!< Select Nordic bridge */

