jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 4..0 : Channel the EVENTS_LOOPSDONE will subscribe to. */
#define PWM_PUBLISH_LOOPSDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define PWM_PUBLISH_LOOPSDONE_CHIDX_Msk (0x1FUL << PWM_PUBLISH_LOOPSDONE_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_RAMUNDERFLOW */
/* Description: Publish configuration for EVENTS_RAMUNDERFLOW */

/* Bit 31 :   */
#define PWM_PUBLISH_RAMUNDERFLOW_EN_Pos (31UL) /*!< Position of EN field. */
#define PWM_PUBLISH_RAMUNDERFLOW_EN_Msk (0x1UL << PWM_PUBLISH_RAMUNDERFLOW_EN_Pos) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_RAMUNDERFLOW_EN_Disabled (0UL) /*!< Disable publishing */
#define PWM_PUBLISH_RAMUNDERFLOW_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_RAMUNDERFLOW will subscribe to. */
#define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Msk (0x1FUL << PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_DMAREADY */
/* Description: Description collection[0]:  Publish configuration for EVENTS_DMAREADY[0] */

/* Bit 31 :   */
#define PWM_PUBLISH_DMAREADY_EN_Pos (31UL) /*!< Position of EN field. */
#define PWM_PUBLISH_DMAREADY_EN_Msk (0x1UL << PWM_PUBLISH_DMAREADY_EN_Pos) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_DMAREADY_EN_Disabled (0UL) /*!< Disable publishing */
#define PWM_PUBLISH_DMAREADY_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_DMAREADY[0] will subscribe to. */
#define PWM_PUBLISH_DMAREADY_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define PWM_PUBLISH_DMAREADY_CHIDX_Msk (0x1FUL << PWM_PUBLISH_DMAREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_DMAEND */
/* Description: Description collection[0]:  Publish configuration for EVENTS_DMAEND[0] */

/* Bit 31 :   */
#define PWM_PUBLISH_DMAEND_EN_Pos (31UL) /*!< Position of EN field. */
#define PWM_PUBLISH_DMAEND_EN_Msk (0x1UL << PWM_PUBLISH_DMAEND_EN_Pos) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_DMAEND_EN_Disabled (0UL) /*!< Disable publishing */
#define PWM_PUBLISH_DMAEND_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_DMAEND[0] will subscribe to. */
#define PWM_PUBLISH_DMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define PWM_PUBLISH_DMAEND_CHIDX_Msk (0x1FUL << PWM_PUBLISH_DMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: PWM_SHORTS */
/* Description: Shortcut register */

/* Bit 5 : Shortcut between RAMUNDERFLOW event and STOP task */
#define PWM_SHORTS_RAMUNDERFLOW_STOP_Pos (5UL) /*!< Position of RAMUNDERFLOW_STOP field. */
#define PWM_SHORTS_RAMUNDERFLOW_STOP_Msk (0x1UL << PWM_SHORTS_RAMUNDERFLOW_STOP_Pos) /*!< Bit mask of RAMUNDERFLOW_STOP field. */
#define PWM_SHORTS_RAMUNDERFLOW_STOP_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_RAMUNDERFLOW_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between LOOPSDONE event and STOP task */
#define PWM_SHORTS_LOOPSDONE_STOP_Pos (4UL) /*!< Position of LOOPSDONE_STOP field. */
#define PWM_SHORTS_LOOPSDONE_STOP_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_STOP_Pos) /*!< Bit mask of LOOPSDONE_STOP field. */
#define PWM_SHORTS_LOOPSDONE_STOP_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between LOOPSDONE event and SEQSTART[1] task */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Pos (3UL) /*!< Position of LOOPSDONE_SEQSTART1 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_SEQSTART1_Pos) /*!< Bit mask of LOOPSDONE_SEQSTART1 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between LOOPSDONE event and SEQSTART[0] task */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Pos (2UL) /*!< Position of LOOPSDONE_SEQSTART0 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_SEQSTART0_Pos) /*!< Bit mask of LOOPSDONE_SEQSTART0 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between SEQEND[1] event and STOP task */
#define PWM_SHORTS_SEQEND1_STOP_Pos (1UL) /*!< Position of SEQEND1_STOP field. */
#define PWM_SHORTS_SEQEND1_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND1_STOP_Pos) /*!< Bit mask of SEQEND1_STOP field. */
#define PWM_SHORTS_SEQEND1_STOP_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_SEQEND1_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between SEQEND[0] event and STOP task */
#define PWM_SHORTS_SEQEND0_STOP_Pos (0UL) /*!< Position of SEQEND0_STOP field. */
#define PWM_SHORTS_SEQEND0_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND0_STOP_Pos) /*!< Bit mask of SEQEND0_STOP field. */
#define PWM_SHORTS_SEQEND0_STOP_Disabled (0UL) /*!< Disable shortcut */
#define PWM_SHORTS_SEQEND0_STOP_Enabled (1UL) /*!< Enable shortcut */

/* Register: PWM_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 12 : Enable or disable interrupt for DMAEND[1] event */
#define PWM_INTEN_DMAEND1_Pos (12UL) /*!< Position of DMAEND1 field. */
#define PWM_INTEN_DMAEND1_Msk (0x1UL << PWM_INTEN_DMAEND1_Pos) /*!< Bit mask of DMAEND1 field. */
#define PWM_INTEN_DMAEND1_Disabled (0UL) /*!< Disable */
#define PWM_INTEN_DMAEND1_Enabled (1UL) /*!< Enable */

/* Bit 11 : Enable or disable interrupt for DMAEND[0] event */
#define PWM_INTEN_DMAEND0_Pos (11UL) /*!< Position of DMAEND0 field. */
#define PWM_INTEN_DMAEND0_Msk (0x1UL << PWM_INTEN_DMAEND0_Pos) /*!< Bit mask of DMAEND0 field. */
#define PWM_INTEN_DMAEND0_Disabled (0UL) /*!< Disable */
#define PWM_INTEN_DMAEND0_Enabled (1UL) /*!< Enable */

/* Bit 10 : Enable or disable interrupt for DMAREADY[1] event */
#define PWM_INTEN_DMAREADY1_Pos (10UL) /*!< Position of DMAREADY1 field. */
#define PWM_INTEN_DMAREADY1_Msk (0x1UL << PWM_INTEN_DMAREADY1_Pos) /*!< Bit mask of DMAREADY1 field. */
#define PWM_INTEN_DMAREADY1_Disabled (0UL) /*!< Disable */
#define PWM_INTEN_DMAREADY1_Enabled (1UL) /*!< Enable */

/* Bit 9 : Enable or disable interrupt for DMAREADY[0] event */
#define PWM_INTEN_DMAREADY0_Pos (9UL) /*!< Position of DMAREADY0 field. */
#define PWM_INTEN_DMAREADY0_Msk (0x1UL << PWM_INTEN_DMAREADY0_Pos) /*!< Bit mask of DMAREADY0 field. */
#define PWM_INTEN_DMAREADY0_Disabled (0UL) /*!< Disable */
#define PWM_INTEN_DMAREADY0_Enabled (1UL) /*!< Enable */

/* Bit 8 : Enable or disable interrupt for RAMUNDERFLOW event */
#define PWM_INTEN_RAMUNDERFLOW_Pos (8UL) /*!< Position of RAMUNDERFLOW field. */
#define PWM_INTEN_RAMUNDERFLOW_Msk (0x1UL << PWM_INTEN_RAMUNDERFLOW_Pos) /*!< Bit mask of RAMUNDERFLOW field. */
#define PWM_INTEN_RAMUNDERFLOW_Disabled (0UL) /*!< Disable */
#define PWM_INTEN_RAMUNDERFLOW_Enabled (1UL) /*!< Enable */

