jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: REGULATORS_DCDCEN2 */
/* Description: DC/DC enable register for REG2 (AVDD_1V3) */

/* Bit 0 : Enable or disable DC/DC mode. */
#define REGULATORS_DCDCEN2_DCDCEN_Pos (0UL) /*!< Position of DCDCEN field. */
#define REGULATORS_DCDCEN2_DCDCEN_Msk (0x1UL << REGULATORS_DCDCEN2_DCDCEN_Pos) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_DCDCEN2_DCDCEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_DCDCEN2_DCDCEN_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_DCDCENMIR */
/* Description: Enable mirroring of DCDCEN register into DCDCEN2 register. */

/* Bit 0 : Enable or disable mirroring of DCDCEN register into DCDCEN2 register. */
#define REGULATORS_DCDCENMIR_DCDCENMIR_Pos (0UL) /*!< Position of DCDCENMIR field. */
#define REGULATORS_DCDCENMIR_DCDCENMIR_Msk (0x1UL << REGULATORS_DCDCENMIR_DCDCENMIR_Pos) /*!< Bit mask of DCDCENMIR field. */
#define REGULATORS_DCDCENMIR_DCDCENMIR_Disabled (0UL) /*!< DCDCEN and DCDCEN2 can be set independently */
#define REGULATORS_DCDCENMIR_DCDCENMIR_Enabled (1UL) /*!< DCDCEN2 is a mirrored version of DCDCEN register. */

/* Register: REGULATORS_ATEPOWER */
/* Description: Analog test bus control for power modules */

/* Bit 8 : Connect or disconnect reference generator for flash to analog test bus */
#define REGULATORS_ATEPOWER_VREFNVM_Pos (8UL) /*!< Position of VREFNVM field. */
#define REGULATORS_ATEPOWER_VREFNVM_Msk (0x1UL << REGULATORS_ATEPOWER_VREFNVM_Pos) /*!< Bit mask of VREFNVM field. */
#define REGULATORS_ATEPOWER_VREFNVM_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREFNVM_Connected (1UL) /*!< Connect 0.9 V downscaled reference voltage to ATB0 */

/* Bits 6..5 : Configure connection of master bias generator to analog test bus */
#define REGULATORS_ATEPOWER_MBIAS_Pos (5UL) /*!< Position of MBIAS field. */
#define REGULATORS_ATEPOWER_MBIAS_Msk (0x3UL << REGULATORS_ATEPOWER_MBIAS_Pos) /*!< Bit mask of MBIAS field. */
#define REGULATORS_ATEPOWER_MBIAS_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_MBIAS_VBG (1UL) /*!< Connect 0.9 V bandgap voltage to ATB0 */
#define REGULATORS_ATEPOWER_MBIAS_IBPSR10U (2UL) /*!< Connect 10 uA IBPSR current to ATB1 */
#define REGULATORS_ATEPOWER_MBIAS_Both (3UL) /*!< Connect both VBG to ATB0 and IBPSR10U to ATB1 */

/* Bit 4 : Connect or disconnect AVSS to analog test bus */
#define REGULATORS_ATEPOWER_AVSS_Pos (4UL) /*!< Position of AVSS field. */
#define REGULATORS_ATEPOWER_AVSS_Msk (0x1UL << REGULATORS_ATEPOWER_AVSS_Pos) /*!< Bit mask of AVSS field. */
#define REGULATORS_ATEPOWER_AVSS_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_AVSS_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 3 : Connect or disconnect DVDD_0V9 to analog test bus */
#define REGULATORS_ATEPOWER_DVDD0V9_Pos (3UL) /*!< Position of DVDD0V9 field. */
#define REGULATORS_ATEPOWER_DVDD0V9_Msk (0x1UL << REGULATORS_ATEPOWER_DVDD0V9_Pos) /*!< Bit mask of DVDD0V9 field. */
#define REGULATORS_ATEPOWER_DVDD0V9_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_DVDD0V9_Connected (1UL) /*!< Connect to ATB0 */

/* Bit 2 : Connect or disconnect AVDD_1V3 to analog test bus */
#define REGULATORS_ATEPOWER_AVDD1V3_Pos (2UL) /*!< Position of AVDD1V3 field. */
#define REGULATORS_ATEPOWER_AVDD1V3_Msk (0x1UL << REGULATORS_ATEPOWER_AVDD1V3_Pos) /*!< Bit mask of AVDD1V3 field. */
#define REGULATORS_ATEPOWER_AVDD1V3_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_AVDD1V3_Connected (1UL) /*!< Connect to ATB0 */

/* Bit 1 : Enable or disable overvoltage clamp on analog test bus */
#define REGULATORS_ATEPOWER_OVCLAMP_Pos (1UL) /*!< Position of OVCLAMP field. */
#define REGULATORS_ATEPOWER_OVCLAMP_Msk (0x1UL << REGULATORS_ATEPOWER_OVCLAMP_Pos) /*!< Bit mask of OVCLAMP field. */
#define REGULATORS_ATEPOWER_OVCLAMP_Disabled (0UL) /*!< Disable */
#define REGULATORS_ATEPOWER_OVCLAMP_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable power-down clamp on analog test bus */
#define REGULATORS_ATEPOWER_PDCLAMP_Pos (0UL) /*!< Position of PDCLAMP field. */
#define REGULATORS_ATEPOWER_PDCLAMP_Msk (0x1UL << REGULATORS_ATEPOWER_PDCLAMP_Pos) /*!< Bit mask of PDCLAMP field. */
#define REGULATORS_ATEPOWER_PDCLAMP_Disabled (0UL) /*!< Disable */
#define REGULATORS_ATEPOWER_PDCLAMP_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_DCDCCONFREG1 */
/* Description: Configuration register for REG1 DCDC regulator (DVDD_0V9). */

/* Bits 8..7 : Input clock selection. */
#define REGULATORS_DCDCCONFREG1_BUCK_CKSEL_Pos (7UL) /*!< Position of BUCK_CKSEL field. */
#define REGULATORS_DCDCCONFREG1_BUCK_CKSEL_Msk (0x3UL << REGULATORS_DCDCCONFREG1_BUCK_CKSEL_Pos) /*!< Bit mask of BUCK_CKSEL field. */
#define REGULATORS_DCDCCONFREG1_BUCK_CKSEL_NORMAL (0UL) /*!< normal clock */
#define REGULATORS_DCDCCONFREG1_BUCK_CKSEL_INVERTED (1UL) /*!< inverted clock */

/* Bits 6..5 : Output voltage selection. */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_Pos (5UL) /*!< Position of BUCK_VOLTAGE field. */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_Msk (0x3UL << REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_Pos) /*!< Bit mask of BUCK_VOLTAGE field. */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_1V00 (0UL) /*!< 1.00 V */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_1V09 (1UL) /*!< 1.09 V */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_1V17 (2UL) /*!< 1.17 V */
#define REGULATORS_DCDCCONFREG1_BUCK_VOLTAGE_1V26 (3UL) /*!< 1.26 V */

/* Bits 4..0 : Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level. */
#define REGULATORS_DCDCCONFREG1_BUCK_CAL_Pos (0UL) /*!< Position of BUCK_CAL field. */
#define REGULATORS_DCDCCONFREG1_BUCK_CAL_Msk (0x1FUL << REGULATORS_DCDCCONFREG1_BUCK_CAL_Pos) /*!< Bit mask of BUCK_CAL field. */

/* Register: REGULATORS_DCDCCONFREG2 */
/* Description: Configuration register for REG2 DCDC regulator (AVDD_1V3). */

/* Bits 8..7 : Input clock selection. */
#define REGULATORS_DCDCCONFREG2_BUCK_CKSEL_Pos (7UL) /*!< Position of BUCK_CKSEL field. */
#define REGULATORS_DCDCCONFREG2_BUCK_CKSEL_Msk (0x3UL << REGULATORS_DCDCCONFREG2_BUCK_CKSEL_Pos) /*!< Bit mask of BUCK_CKSEL field. */
#define REGULATORS_DCDCCONFREG2_BUCK_CKSEL_NORMAL (0UL) /*!< normal clock */
#define REGULATORS_DCDCCONFREG2_BUCK_CKSEL_INVERTED (1UL) /*!< inverted clock */

