jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 6..5 : Output voltage selection. */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_Pos (5UL) /*!< Position of BUCK_VOLTAGE field. */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_Msk (0x3UL << REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_Pos) /*!< Bit mask of BUCK_VOLTAGE field. */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_1V00 (0UL) /*!< 1.00 V */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_1V09 (1UL) /*!< 1.09 V */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_1V17 (2UL) /*!< 1.17 V */
#define REGULATORS_DCDCCONFREG2_BUCK_VOLTAGE_1V26 (3UL) /*!< 1.26 V */

/* Bits 4..0 : Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level. */
#define REGULATORS_DCDCCONFREG2_BUCK_CAL_Pos (0UL) /*!< Position of BUCK_CAL field. */
#define REGULATORS_DCDCCONFREG2_BUCK_CAL_Msk (0x1FUL << REGULATORS_DCDCCONFREG2_BUCK_CAL_Pos) /*!< Bit mask of BUCK_CAL field. */

/* Register: REGULATORS_FORCEMODEREG1 */
/* Description: A backdoor register for manual selection of REG1 regulator mode (DVDD_0V9) */

/* Bits 6..0 : Force Regulator Power Mode */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_Pos (0UL) /*!< Position of FORCEMODE field. */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_Msk (0x7FUL << REGULATORS_FORCEMODEREG1_FORCEMODE_Pos) /*!< Bit mask of FORCEMODE field. */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_EXT (0UL) /*!< Force external (DVDD_0V9 supplied externally) */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_DCDC (3UL) /*!< Force DCDC mode */
#define REGULATORS_FORCEMODEREG1_FORCEMODE_DCDC_REFRESH (4UL) /*!< Force DCDC REFRESH mode */

/* Register: REGULATORS_THRESHOLDREG1 */
/* Description: Set threshold value of REG1 DCDC regulator */

/* Bits 6..0 : Sets the threshold value of power regulator. Note: The reset value comes from FICR (see FICR chapter for details) */
#define REGULATORS_THRESHOLDREG1_THRESHOLD_Pos (0UL) /*!< Position of THRESHOLD field. */
#define REGULATORS_THRESHOLDREG1_THRESHOLD_Msk (0x7FUL << REGULATORS_THRESHOLDREG1_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field. */

/* Register: REGULATORS_ENFORCEMODEREG1 */
/* Description: Enable forcing of power mode in REG1 voltage regulator */

/* Bit 0 : Enable forcing of power mode in voltage regulator */
#define REGULATORS_ENFORCEMODEREG1_ENFORCEMODE_Pos (0UL) /*!< Position of ENFORCEMODE field. */
#define REGULATORS_ENFORCEMODEREG1_ENFORCEMODE_Msk (0x1UL << REGULATORS_ENFORCEMODEREG1_ENFORCEMODE_Pos) /*!< Bit mask of ENFORCEMODE field. */
#define REGULATORS_ENFORCEMODEREG1_ENFORCEMODE_Disabled (0UL) /*!< Regulator mode forcing OFF */
#define REGULATORS_ENFORCEMODEREG1_ENFORCEMODE_Enabled (1UL) /*!< Regulator forced ON in a power mode given by FORCEREGMODE1 */

/* Register: REGULATORS_IGNOREDAPCMODE */
/* Description: Ignore DAPCP power mode */

/* Bit 0 : Ignore power request from debugger */
#define REGULATORS_IGNOREDAPCMODE_IGNOREDAPCMODE_Pos (0UL) /*!< Position of IGNOREDAPCMODE field. */
#define REGULATORS_IGNOREDAPCMODE_IGNOREDAPCMODE_Msk (0x1UL << REGULATORS_IGNOREDAPCMODE_IGNOREDAPCMODE_Pos) /*!< Bit mask of IGNOREDAPCMODE field. */
#define REGULATORS_IGNOREDAPCMODE_IGNOREDAPCMODE_Do not ignore (0UL) /*!< Do not ignore power request form debugger */
#define REGULATORS_IGNOREDAPCMODE_IGNOREDAPCMODE_Ignore (1UL) /*!< Ignore power request from debugger */

/* Register: REGULATORS_CURRENTMODEREG1 */
/* Description: Currently used power mode of the REG1 voltage regulator */

/* Bits 6..0 : Currently used mode of the voltage regulator */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_Pos (0UL) /*!< Position of CURRENTMODE field. */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_Msk (0x7FUL << REGULATORS_CURRENTMODEREG1_CURRENTMODE_Pos) /*!< Bit mask of CURRENTMODE field. */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_EXT (0UL) /*!< Externally supplied DVDD_0V9 */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_DCDC (2UL) /*!< DCDC mode */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_DCDC_REFRESH (3UL) /*!< DCDC REFRESH mode */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_LDO (4UL) /*!< LDO mode */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_LDO_DCDC (6UL) /*!< swithching between LDO and DCDC (in any direction) Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_LDO_DCDC_REFRESH (7UL) /*!< swithching between LDO and DCDC-REFRESH (in any direction) Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_ULP (8UL) /*!< ULP mode */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_DCDC_ULP (10UL) /*!< swithching from DCDC to ULP Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_DCDC_REFRESH_ULP (11UL) /*!< swithching from DCDC-REFRESH to ULP Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG1_CURRENTMODE_ULP_LDO (12UL) /*!< swithching between ULP and LDO (in any direction) Intermediate state when both regulators are ON */

/* Register: REGULATORS_FORCEMODEREG2 */
/* Description: A backdoor register for manual selection of REG2 regulator mode (DVDD_1V3) */

/* Bits 6..0 : Force Regulator Power Mode */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_Pos (0UL) /*!< Position of FORCEMODE field. */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_Msk (0x7FUL << REGULATORS_FORCEMODEREG2_FORCEMODE_Pos) /*!< Bit mask of FORCEMODE field. */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_EXT (0UL) /*!< Force external (AVDD_1V3 supplied externally) */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_DCDC (3UL) /*!< Force DCDC mode */
#define REGULATORS_FORCEMODEREG2_FORCEMODE_DCDC_REFRESH (4UL) /*!< Force DCDC REFRESH mode */

/* Register: REGULATORS_THRESHOLDREG2 */
/* Description: Set threshold value of REG2 DCDC regulator */

