jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 6..0 : Sets the threshold value of power regulator. Note: The reset value comes from FICR (see FICR chapter for details) */
#define REGULATORS_THRESHOLDREG2_THRESHOLD_Pos (0UL) /*!< Position of THRESHOLD field. */
#define REGULATORS_THRESHOLDREG2_THRESHOLD_Msk (0x7FUL << REGULATORS_THRESHOLDREG2_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field. */

/* Register: REGULATORS_ENFORCEMODEREG2 */
/* Description: Enable forcing of power mode in REG2 voltage regulator */

/* Bit 0 : Enable forcing of power mode in voltage regulator */
#define REGULATORS_ENFORCEMODEREG2_ENFORCEMODE_Pos (0UL) /*!< Position of ENFORCEMODE field. */
#define REGULATORS_ENFORCEMODEREG2_ENFORCEMODE_Msk (0x1UL << REGULATORS_ENFORCEMODEREG2_ENFORCEMODE_Pos) /*!< Bit mask of ENFORCEMODE field. */
#define REGULATORS_ENFORCEMODEREG2_ENFORCEMODE_Disabled (0UL) /*!< Regulator mode forcing OFF */
#define REGULATORS_ENFORCEMODEREG2_ENFORCEMODE_Enabled (1UL) /*!< Regulator forced ON in a power mode given by FORCEREGMODE2 */

/* Register: REGULATORS_DISABLEHSLIMITREG2 */
/* Description: Disable HSLIMIT for REG2 DCDC regulator */

/* Bit 0 : Enable or disable HSLIMIT for DCDC regulator */
#define REGULATORS_DISABLEHSLIMITREG2_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLEHSLIMITREG2_DISABLE_Msk (0x1UL << REGULATORS_DISABLEHSLIMITREG2_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLEHSLIMITREG2_DISABLE_Enabled (0UL) /*!< Enable HSLIMIT */
#define REGULATORS_DISABLEHSLIMITREG2_DISABLE_Disabled (1UL) /*!< Disable HSLIMIT */

/* Register: REGULATORS_CURRENTMODEREG2 */
/* Description: Currently used power mode of the REG2 voltage regulator */

/* Bits 6..0 : Currently used mode of the voltage regulator */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_Pos (0UL) /*!< Position of CURRENTMODE field. */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_Msk (0x7FUL << REGULATORS_CURRENTMODEREG2_CURRENTMODE_Pos) /*!< Bit mask of CURRENTMODE field. */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_EXT (0UL) /*!< Externally supplied AVDD_1V3 */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_DCDC (2UL) /*!< DCDC mode */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_DCDC_REFRESH (3UL) /*!< DCDC REFRESH mode */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_LDO (4UL) /*!< LDO mode */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_LDO_DCDC (6UL) /*!< swithching between LDO and DCDC (in any direction) Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_LDO_DCDC_REFRESH (7UL) /*!< swithching between LDO and DCDC-REFRESH (in any direction) Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_ULP (8UL) /*!< ULP mode */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_DCDC_ULP (10UL) /*!< swithching from DCDC to ULP Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_DCDC_REFRESH_ULP (11UL) /*!< swithching from DCDC-REFRESH to ULP Intermediate state when both regulators are ON */
#define REGULATORS_CURRENTMODEREG2_CURRENTMODE_ULP_LDO (12UL) /*!< swithching between ULP and LDO (in any direction) Intermediate state when both regulators are ON */

/* Register: REGULATORS_DISABLEHSLIMITREG1 */
/* Description: Disable HSLIMIT for REG1 DCDC regulator */

/* Bit 0 : Enable or disable HSLIMIT for DCDC regulator */
#define REGULATORS_DISABLEHSLIMITREG1_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLEHSLIMITREG1_DISABLE_Msk (0x1UL << REGULATORS_DISABLEHSLIMITREG1_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLEHSLIMITREG1_DISABLE_Enabled (0UL) /*!< Enable HSLIMIT */
#define REGULATORS_DISABLEHSLIMITREG1_DISABLE_Disabled (1UL) /*!< Disable HSLIMIT */

/* Register: REGULATORS_LDOCONFREG1 */
/* Description: Configuration register for REG1 LDO regulator (DVDD_0V9). */

/* Bits 2..0 : Output voltage calibration. */
#define REGULATORS_LDOCONFREG1_VREGTRIM_Pos (0UL) /*!< Position of VREGTRIM field. */
#define REGULATORS_LDOCONFREG1_VREGTRIM_Msk (0x7UL << REGULATORS_LDOCONFREG1_VREGTRIM_Pos) /*!< Bit mask of VREGTRIM field. */
#define REGULATORS_LDOCONFREG1_VREGTRIM_000 (0UL) /*!< 1.082 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_001 (1UL) /*!< 1.108 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_010 (2UL) /*!< 1.136 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_011 (3UL) /*!< 1.163 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_100 (4UL) /*!< 0.980 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_101 (5UL) /*!< 1.003 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_110 (6UL) /*!< 1.029 V */
#define REGULATORS_LDOCONFREG1_VREGTRIM_111 (7UL) /*!< 1.054 V */

/* Register: REGULATORS_LDOTESTLOADREG1 */
/* Description: Test load setting for REG1 LDO regulator (DVDD_0V9). */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_Pos (0UL) /*!< Position of VREGLOAD field. */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_Msk (0x7UL << REGULATORS_LDOTESTLOADREG1_VREGLOAD_Pos) /*!< Bit mask of VREGLOAD field. */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_Normal operation (0UL) /*!< Normal operation (default) */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_1mA test load (1UL) /*!< 1mA test load */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_50mA test load (2UL) /*!< 50mA test load */
#define REGULATORS_LDOTESTLOADREG1_VREGLOAD_150mA test load (3UL) /*!< 150mA test load */

/* Register: REGULATORS_LDOCONFREG2 */
/* Description: Configuration register for REG2 LDO regulator (AVDD_1V3). */

/* Bits 2..0 : Output voltage calibration. */
#define REGULATORS_LDOCONFREG2_VREGTRIM_Pos (0UL) /*!< Position of VREGTRIM field. */
#define REGULATORS_LDOCONFREG2_VREGTRIM_Msk (0x7UL << REGULATORS_LDOCONFREG2_VREGTRIM_Pos) /*!< Bit mask of VREGTRIM field. */
#define REGULATORS_LDOCONFREG2_VREGTRIM_000 (0UL) /*!< 1.255 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_001 (1UL) /*!< 1.289 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_010 (2UL) /*!< 1.324 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_011 (3UL) /*!< 1.357 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_100 (4UL) /*!< 0.117 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_101 (5UL) /*!< 1.150 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_110 (6UL) /*!< 1.185 V */
#define REGULATORS_LDOCONFREG2_VREGTRIM_111 (7UL) /*!< 1.219 V */

/* Register: REGULATORS_LDOTESTLOADREG2 */
/* Description: Test load setting for REG2 LDO regulator (AVDD_1V3). */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_Pos (0UL) /*!< Position of VREGLOAD field. */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_Msk (0x7UL << REGULATORS_LDOTESTLOADREG2_VREGLOAD_Pos) /*!< Bit mask of VREGLOAD field. */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_Normal operation (0UL) /*!< Normal operation (default) */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_1mA test load (1UL) /*!< 1mA test load */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_50mA test load (2UL) /*!< 50mA test load */
#define REGULATORS_LDOTESTLOADREG2_VREGLOAD_150mA test load (3UL) /*!< 150mA test load */

/* Register: REGULATORS_ULPCONFREG1 */
/* Description: Configuration register for REG1 ULP regulator (DVDD_0V9). */

/* Bits 2..0 : Output voltage calibration. 0: minimum voltage 7: maximum voltage */
#define REGULATORS_ULPCONFREG1_ULPTRIM_Pos (0UL) /*!< Position of ULPTRIM field. */
#define REGULATORS_ULPCONFREG1_ULPTRIM_Msk (0x7UL << REGULATORS_ULPCONFREG1_ULPTRIM_Pos) /*!< Bit mask of ULPTRIM field. */

