jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Register: REGULATORS_ULPCONFREG2 */
/* Description: Configuration register for REG2 ULP regulator (AVDD_1V3). */

/* Bits 2..0 : Output voltage calibration. 0: minimum voltage 7: maximum voltage */
#define REGULATORS_ULPCONFREG2_ULPTRIM_Pos (0UL) /*!< Position of ULPTRIM field. */
#define REGULATORS_ULPCONFREG2_ULPTRIM_Msk (0x7UL << REGULATORS_ULPCONFREG2_ULPTRIM_Pos) /*!< Bit mask of ULPTRIM field. */

/* Register: REGULATORS_VREG_HIGH_REG1 */
/* Description: Increase voltage to AVDD_1V3 levels for REG1 LDO regulator (DVDD_0V9) */

/* Bit 0 : Enable or disable the feature */
#define REGULATORS_VREG_HIGH_REG1_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define REGULATORS_VREG_HIGH_REG1_ENABLE_Msk (0x1UL << REGULATORS_VREG_HIGH_REG1_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define REGULATORS_VREG_HIGH_REG1_ENABLE_Disabled (0UL) /*!< Nominal output levels of REG1 LDO */
#define REGULATORS_VREG_HIGH_REG1_ENABLE_Enabled (1UL) /*!< Increased output levels of REG1 LDO */

/* Register: REGULATORS_ULP_HIGH_REG1 */
/* Description: Increase voltage to AVDD_1V3 ULP levels for REG1 ULP regulator (DVDD_0V9) */

/* Bit 0 : Enable or disable the feature */
#define REGULATORS_ULP_HIGH_REG1_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define REGULATORS_ULP_HIGH_REG1_ENABLE_Msk (0x1UL << REGULATORS_ULP_HIGH_REG1_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define REGULATORS_ULP_HIGH_REG1_ENABLE_Disabled (0UL) /*!< Nominal output levels of REG1 ULP */
#define REGULATORS_ULP_HIGH_REG1_ENABLE_Enabled (1UL) /*!< Increased output levels of REG1 ULP */

/* Register: REGULATORS_DISABLESRAMSYSTEMOFFACK */
/* Description: Enable or disable System OFF ack from SRAM */

/* Bit 0 : Enable or disable System OFF ack from SRAM */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Msk (0x1UL << REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Enabled (0UL) /*!< Enable ack */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Disabled (1UL) /*!< Disable ack */

/* Register: REGULATORS_DISABLENVMSYSTEMOFFACK */
/* Description: Enable or disable System OFF ack from NVM */

/* Bit 0 : Enable or disable System OFF ack from NVM */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Msk (0x1UL << REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Enabled (0UL) /*!< Enable ack */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Disabled (1UL) /*!< Disable ack */


/* Peripheral: RTC */
/* Description: Real time counter 0 */

/* Register: RTC_SUBSCRIBE_START */
/* Description: Subscribe configuration for TASKS_START */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_START_EN_Pos (31UL) /*!< Position of EN field. */
#define RTC_SUBSCRIBE_START_EN_Msk (0x1UL << RTC_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_START_EN_Disabled (0UL) /*!< Disable subscription */
#define RTC_SUBSCRIBE_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_START will subscribe to. */
#define RTC_SUBSCRIBE_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_START_CHIDX_Msk (0x1FUL << RTC_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for TASKS_STOP */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RTC_SUBSCRIBE_STOP_EN_Msk (0x1UL << RTC_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RTC_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_STOP will subscribe to. */
#define RTC_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_STOP_CHIDX_Msk (0x1FUL << RTC_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_CLEAR */
/* Description: Subscribe configuration for TASKS_CLEAR */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_CLEAR_EN_Pos (31UL) /*!< Position of EN field. */
#define RTC_SUBSCRIBE_CLEAR_EN_Msk (0x1UL << RTC_SUBSCRIBE_CLEAR_EN_Pos) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_CLEAR_EN_Disabled (0UL) /*!< Disable subscription */
#define RTC_SUBSCRIBE_CLEAR_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_CLEAR will subscribe to. */
#define RTC_SUBSCRIBE_CLEAR_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_CLEAR_CHIDX_Msk (0x1FUL << RTC_SUBSCRIBE_CLEAR_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_TRIGOVRFLW */
/* Description: Subscribe configuration for TASKS_TRIGOVRFLW */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos (31UL) /*!< Position of EN field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Msk (0x1UL << RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Disabled (0UL) /*!< Disable subscription */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel the TASKS_TRIGOVRFLW will subscribe to. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Msk (0x1FUL << RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RTC_PUBLISH_TICK */
/* Description: Publish configuration for EVENTS_TICK */

/* Bit 31 :   */
#define RTC_PUBLISH_TICK_EN_Pos (31UL) /*!< Position of EN field. */
#define RTC_PUBLISH_TICK_EN_Msk (0x1UL << RTC_PUBLISH_TICK_EN_Pos) /*!< Bit mask of EN field. */
#define RTC_PUBLISH_TICK_EN_Disabled (0UL) /*!< Disable publishing */
#define RTC_PUBLISH_TICK_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_TICK will subscribe to. */
#define RTC_PUBLISH_TICK_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RTC_PUBLISH_TICK_CHIDX_Msk (0x1FUL << RTC_PUBLISH_TICK_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

