jorgenmk/zephyr/ext/hal/nordic/nrfx/mdk/nrf9120_mlm1_bitfields.h
/* Bits 4..0 : Channel the EVENTS_ENDEPOUT[0] will subscribe to. */
#define USBD_PUBLISH_ENDEPOUT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDEPOUT_CHIDX_Msk (0x1FUL << USBD_PUBLISH_ENDEPOUT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ENDISOOUT */
/* Description: Description collection[0]:  Publish configuration for EVENTS_ENDISOOUT[0] */

/* Bit 31 :   */
#define USBD_PUBLISH_ENDISOOUT_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_ENDISOOUT_EN_Msk (0x1UL << USBD_PUBLISH_ENDISOOUT_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ENDISOOUT_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_ENDISOOUT_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_ENDISOOUT[0] will subscribe to. */
#define USBD_PUBLISH_ENDISOOUT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDISOOUT_CHIDX_Msk (0x1FUL << USBD_PUBLISH_ENDISOOUT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_SOF */
/* Description: Publish configuration for EVENTS_SOF */

/* Bit 31 :   */
#define USBD_PUBLISH_SOF_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_SOF_EN_Msk (0x1UL << USBD_PUBLISH_SOF_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_SOF_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_SOF_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_SOF will subscribe to. */
#define USBD_PUBLISH_SOF_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_SOF_CHIDX_Msk (0x1FUL << USBD_PUBLISH_SOF_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_USBEVENT */
/* Description: Publish configuration for EVENTS_USBEVENT */

/* Bit 31 :   */
#define USBD_PUBLISH_USBEVENT_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_USBEVENT_EN_Msk (0x1UL << USBD_PUBLISH_USBEVENT_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_USBEVENT_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_USBEVENT_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_USBEVENT will subscribe to. */
#define USBD_PUBLISH_USBEVENT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_USBEVENT_CHIDX_Msk (0x1FUL << USBD_PUBLISH_USBEVENT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EP0SETUP */
/* Description: Publish configuration for EVENTS_EP0SETUP */

/* Bit 31 :   */
#define USBD_PUBLISH_EP0SETUP_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_EP0SETUP_EN_Msk (0x1UL << USBD_PUBLISH_EP0SETUP_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EP0SETUP_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_EP0SETUP_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_EP0SETUP will subscribe to. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Msk (0x1FUL << USBD_PUBLISH_EP0SETUP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EPDATA */
/* Description: Publish configuration for EVENTS_EPDATA */

/* Bit 31 :   */
#define USBD_PUBLISH_EPDATA_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Msk (0x1UL << USBD_PUBLISH_EPDATA_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_EPDATA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_EPDATA will subscribe to. */
#define USBD_PUBLISH_EPDATA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EPDATA_CHIDX_Msk (0x1FUL << USBD_PUBLISH_EPDATA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ACCESSFAULT */
/* Description: Publish configuration for EVENTS_ACCESSFAULT */

/* Bit 31 :   */
#define USBD_PUBLISH_ACCESSFAULT_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_ACCESSFAULT_EN_Msk (0x1UL << USBD_PUBLISH_ACCESSFAULT_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ACCESSFAULT_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_ACCESSFAULT_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel the EVENTS_ACCESSFAULT will subscribe to. */
#define USBD_PUBLISH_ACCESSFAULT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ACCESSFAULT_CHIDX_Msk (0x1FUL << USBD_PUBLISH_ACCESSFAULT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SHORTS */
/* Description: Shortcut register */

/* Bit 8 : Shortcut between ENDISOOUT[0] event and STARTISOIN[0] task */
#define USBD_SHORTS_ENDISOOUT0_STARTISOIN0_Pos (8UL) /*!< Position of ENDISOOUT0_STARTISOIN0 field. */
#define USBD_SHORTS_ENDISOOUT0_STARTISOIN0_Msk (0x1UL << USBD_SHORTS_ENDISOOUT0_STARTISOIN0_Pos) /*!< Bit mask of ENDISOOUT0_STARTISOIN0 field. */
#define USBD_SHORTS_ENDISOOUT0_STARTISOIN0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDISOOUT0_STARTISOIN0_Enabled (1UL) /*!< Enable shortcut */

/* Bit 7 : Shortcut between ENDISOIN[0] event and STARTISOOUT[0] task */
#define USBD_SHORTS_ENDISOIN0_STARTISOOUT0_Pos (7UL) /*!< Position of ENDISOIN0_STARTISOOUT0 field. */
#define USBD_SHORTS_ENDISOIN0_STARTISOOUT0_Msk (0x1UL << USBD_SHORTS_ENDISOIN0_STARTISOOUT0_Pos) /*!< Bit mask of ENDISOIN0_STARTISOOUT0 field. */
#define USBD_SHORTS_ENDISOIN0_STARTISOOUT0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDISOIN0_STARTISOOUT0_Enabled (1UL) /*!< Enable shortcut */

/* Bit 6 : Shortcut between SOF event and STARTISOOUT[0] task */
#define USBD_SHORTS_SOF_STARTISOOUT0_Pos (6UL) /*!< Position of SOF_STARTISOOUT0 field. */
#define USBD_SHORTS_SOF_STARTISOOUT0_Msk (0x1UL << USBD_SHORTS_SOF_STARTISOOUT0_Pos) /*!< Bit mask of SOF_STARTISOOUT0 field. */
#define USBD_SHORTS_SOF_STARTISOOUT0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_SOF_STARTISOOUT0_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between SOF event and STARTISOIN[0] task */
#define USBD_SHORTS_SOF_STARTISOIN0_Pos (5UL) /*!< Position of SOF_STARTISOIN0 field. */
#define USBD_SHORTS_SOF_STARTISOIN0_Msk (0x1UL << USBD_SHORTS_SOF_STARTISOIN0_Pos) /*!< Bit mask of SOF_STARTISOIN0 field. */
#define USBD_SHORTS_SOF_STARTISOIN0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_SOF_STARTISOIN0_Enabled (1UL) /*!< Enable shortcut */

